f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
/* APRS tracker for the UV-K1 / UV-K5 V3 (F4HWN base) — see aprs.h.
 *
 * Port of the UV-K5 V1 (KD8CEC) module. Differences from that source, all
 * called out inline below:
 *   - SendReply() is not used to ACK any 0x06Dx command the RP2040 sends us
 *     (RXTEXT/RXINFO/GPS/DIGI), same as the V1 port, see docs/protocol.md --
 *     but it IS used for APRS_CMD_CONFIG, a command *we* originate (radio ->
 *     RP2040, unprompted), same as SARSAT_ReplyStatus() already does.
 *   - UART_IsCommandAvailable()/UART_HandleCommand() take an explicit Port
 *     argument on this firmware (UART_PORT_UART vs UART_PORT_VCP).
 *   - The C-Board AF gain override is the shared app/afgain.h module
 *     (gAfGain / AFGAIN_Apply() / AFGAIN_ResyncKnob()), not a field of
 *     aprs_cfg_t -- the SARSAT screen already needs it independently of
 *     ENABLE_APRS on this port.
 *   - millis10() is a real function here (app/scheduler.c, a getter onto the
 *     existing 10 ms SysTick_Handler() counter), not an extern from a KD8CEC-
 *     specific scheduler -- same name, same semantics, zero call-site changes.
 *   - The EEPROM address for gAprsCfg is this port's own reserved slot (see
 *     below), not KD8CEC's CEC_EEPROM_START2.
 * Everything else (VFO_Info_t, BK4819_* register calls, UI_PrintString*,
 * RADIO_*, SETTINGS_*) is close enough to egzumer/DualTachyon upstream that
 * the logic ports over unchanged -- same lesson as the SARSAT screen.
 */
#include "aprs.h"

#ifdef ENABLE_APRS

#include <string.h>

#include "py32f0xx.h"
#include "external/printf/printf.h"
#include "ax25.h"
#include "app/uart.h"
#include "app/afgain.h"     /* shared C-Board AF-gain setting (gAfGain) */
#include "app/chFrScanner.h"
#include "driver/keyboard.h"
#include "driver/backlight.h"
#include "driver/st7565.h"
#include "driver/system.h"
#include "driver/systick.h"
#include "driver/bk4819.h"
#include "driver/eeprom.h"
#include "driver/vcp.h"     /* diagnostic logging (APRS_Init(), see below) --
                             * the radio's OWN USB CDC port, NOT the UART
                             * link to the C-Board (binary protocol, must
                             * not be mixed with free text) */
#include "ui/helper.h"
#include "ui/ui.h"
#include "audio.h"
#include "radio.h"
#include "functions.h"
#include "settings.h"
#include "misc.h"
#ifdef ENABLE_SARSAT
#include "app/sarsat.h"     /* SARSAT_ScreenOpen() -- don't beacon under F+8  */
#endif

/* EEPROM: 40 bytes right after app/afgain.h's own 8-byte claim (0x0A170), in
 * the same unclaimed tail of the "Settings" PY25Q16 sector -- see afgain.c
 * for the full explanation of why an address needs an explicit ADDR_MAPPINGS
 * entry on this firmware (build.sh wires this one into
 * App/driver/eeprom_compat.c the same way). Same physical sector as the core
 * radio settings and the AF-gain byte, so it survives a normal reset and is
 * only wiped by "reset ALL". */
#define APRS_EE_ADDR        0x0A178u
#define APRS_EE_MAGIC       0xA5
#define APRS_TXDELAY_FLAGS  40          /* ~0.27 s of preamble tone     */
#define APRS_DEFAULT_FREQ   14480000u   /* 144.800000 MHz, 10 Hz units: the
                                        * channel-170 default the first time
                                        * it is ever seen erased           */
#define AFSK_MARK           1200
#define AFSK_SPACE          2200
#define AFSK_TICKS_PER_BIT  40000u      /* 48 MHz SysTick / 1200 baud          */
#define AFSK_TONE_GAIN      64          /* REG_70 tone1 gain 0..127; deviation.
                                        * roger beep uses 66, DTMF 65. Lower
                                        * this if the frame sounds over-deviated */

aprs_cfg_t gAprsCfg;
bool       gAprsShowRequest;

#define APRS_RX_CHARS 18                /* UI_PrintStringSmall* row limit    */
static char     s_rx[4][APRS_RX_CHARS + 1];  /* raw-text fallback (0x06D2)   */
static uint8_t  s_rxn;
static uint16_t s_rx_pkts;              /* total packets shown by the RP2040 */
static bool     s_rx_dirty;             /* a new packet arrived             */
static bool     s_adrasec;              /* a "REPORT ADRASEC" position request
                                        * arrived -- show a sticky coordinate
                                        * screen, EXIT only, no timeout/popup */
static struct { int32_t lat, lon; uint16_t dist_hm, brg; uint8_t hasd;
                char src[10]; } s_adr;  /* its own copy: a later ordinary frame
                                        * overwrites s_rxi but not this screen  */

/* structured decode from the RP2040 (0x06D3). s_rxi.kind mirrors the RP2040's
 * aprs_parse.h enum. */
#define APRS_RX_KIND_OTHER      0
#define APRS_RX_KIND_POSITION   1
#define APRS_RX_KIND_OBJECT     2
#define APRS_RX_KIND_STATUS     3
#define APRS_RX_KIND_MESSAGE    4
#define APRS_RX_KIND_TELEMETRY  5
static struct {
    bool     valid;
    uint8_t  kind, flags;
    char     sym_t, sym_c;
    int32_t  lat, lon;
    uint16_t course, speed, dist_hm, bearing;
    int16_t  alt;
    char     src[10], name[10], via[28], text[44];
    uint32_t at_10ms;
} s_rxi;
static uint32_t s_autopop_block_10ms;   /* no auto-popup until this time    */
static uint32_t s_bl_off_10ms;          /* "light on frame": dim at this time */
static uint32_t s_bl_on_until_10ms;     /* "light on frame": keep reasserting
                                         * BACKLIGHT_TurnOn() until this time --
                                         * a single one-shot call on the RX
                                         * event alone was reported not to
                                         * stick (screen dark through most of
                                         * the popup, only lighting right as
                                         * it closed). Covers background RX
                                         * too (no popup open); the in-popup
                                         * loop has its own per-iteration
                                         * reassertion, see APP_RunAprs(). */
static uint32_t s_next_beacon_10ms;
static bool     s_inited;                /* APRS_Init() has run once        */
extern uint32_t millis10(void);          /* app/scheduler.c                 */

/* SmartBeaconing: two fixed presets, selected through the F_INT menu row by
 * overloading gAprsCfg.interval_s with sentinel values below the smallest real
 * period (30 s). Needs GPS position mode + a live fix (speed / course). */
#define APRS_SB_CAR  1u                  /* interval_s == 1 : car profile    */
#define APRS_SB_FOOT 2u                  /* interval_s == 2 : on-foot profile */
#define APRS_SB_IS(v) ((v) == APRS_SB_CAR || (v) == APRS_SB_FOOT)

