f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
/* ------------------------------------------------------------------ config */
static void APRS_Defaults(void)
{
    memset(&gAprsCfg, 0, sizeof(gAprsCfg));
    gAprsCfg.magic      = APRS_EE_MAGIC;
    strcpy(gAprsCfg.call, "NOCALL");
    gAprsCfg.ssid       = 9;
    gAprsCfg.path       = APRS_PATH_W1W2;
    gAprsCfg.sym_table  = '/';
    gAprsCfg.sym_code   = '>';           /* car */
    gAprsCfg.interval_s = 0;             /* off by default (needs a callsign) */
    gAprsCfg.popup_s    = 10;            /* auto RX-popup 10 s                 */
    gAprsCfg.opts       = (1u << APRS_OPT_SQL_SHIFT);  /* fast squelch, BL stock */
    gAprsCfg.lat_e5     = 0;
    gAprsCfg.lon_e5     = 0;
    strcpy(gAprsCfg.comment, "UV-K5_Sarsat");
}

/* This firmware is a fixed SARSAT / APRS appliance, so it seeds a few
 * dedicated MR channels with sane defaults:
 *
 *   ch 170  "APRS"    144.800 MHz  FM   wide  HIGH   -- the fixed APRS TX slot
 *   ch 1    "SAREX"   434.200 MHz  RAW  wide  LOW    -- SAR exercise beacon
 *   ch 2    "SARSAT"  406.028 MHz  RAW  wide  LOW    -- real 406 MHz (RX only!)
 *
 * A slot is written ONLY while still erased (0xFFFFFFFF frequency): a channel
 * already storing something -- a user edit, or a channel the operator uses for
 * something else -- is never touched (clear it first if you want the default
 * back). The APRS slot's name is additionally re-pinned to "APRS" on every
 * boot, the way KD8CEC's own C-Board project keeps its TX slot dedicated. */
static void APRS_SeedChannel(uint8_t ch, uint32_t freq,
                             uint8_t modulation, uint8_t power, const char *name)
{
    uint32_t cur;
    EEPROM_ReadBuffer((uint16_t)(ch * 16u), &cur, sizeof cur);
    if (cur != 0xFFFFFFFFu)
        return;                       /* slot in use -- leave it alone */
    VFO_Info_t v;
    RADIO_InitInfo(&v, ch, freq);     /* wide + FM + std step by default */
    v.Modulation   = modulation;
    v.OUTPUT_POWER = power;
    SETTINGS_SaveChannel(ch, 0, &v, 2);
    SETTINGS_SaveChannelName(ch, name);
}

static void APRS_EnsureChannel(void)
{
#ifdef ENABLE_BYP_RAW_DEMODULATORS
    const uint8_t discri = MODULATION_RAW;      /* flat FM discriminator ("RAW") */
#else
    const uint8_t discri = MODULATION_FM;
#endif
    APRS_SeedChannel(APRS_TX_CHANNEL, APRS_DEFAULT_FREQ,
                     MODULATION_FM, OUTPUT_POWER_HIGH, "APRS");
    APRS_SeedChannel(0, 43420000u, discri, OUTPUT_POWER_LOW1, "SAREX");
    APRS_SeedChannel(1, 40602800u, discri, OUTPUT_POWER_LOW1, "SARSAT");

    char nm[11];
    SETTINGS_FetchChannelName(nm, APRS_TX_CHANNEL);
    if (strcmp(nm, "APRS") != 0)
        SETTINGS_SaveChannelName(APRS_TX_CHANNEL, "APRS");
}

static void APRS_PushConfig(void);       /* forward decl: used by APRS_Init() below */
static void aprs_refresh_ch_freq(void);  /* forward decl: caches channel 170's freq */

void APRS_Init(void)
{
    EEPROM_ReadBuffer(APRS_EE_ADDR, &gAprsCfg, sizeof(gAprsCfg));
    {
        /* ⚠️ DIAGNOSTIC (2026-09-16, operator-reported): the APRS config
         * sometimes comes back to factory defaults after flashing V3 with
         * the C-Board left attached. This block itself changes nothing --
         * it only logs, over the radio's own USB CDC (VCP), exactly what
         * was read here BEFORE the magic-byte check below decides whether
         * to reset to defaults, so the next occurrence leaves hard evidence
         * instead of a guess:
         *   - magic/call[0] both look erased (0xFF) -> the EEPROM sector
         *     was actually erased (consistent with a full-chip reflash
         *     that also wipes Settings, or a botched erase cycle).
         *   - magic wrong but the raw bytes are NOT uniformly 0xFF (a mix
         *     of plausible-looking and garbage bytes) -> a write was
         *     interrupted partway through, the leading suspect being the
         *     brown-out risk this project already documents for the
         *     C-Board's unbuffered 3.3V rail (docs/hardware.md) -- this
         *     time triggered during the radio's own programming sequence
         *     rather than GPS acquisition.
         *   - magic correct -> this boot is not an instance of the bug;
         *     look elsewhere (e.g. the flashing tool/procedure itself). */
        char dbg[160];
        int n = sprintf(dbg, "[aprs] cfg magic=%02X (want %02X) call[0]=%02X raw:",
                         gAprsCfg.magic, APRS_EE_MAGIC, (unsigned)(uint8_t)gAprsCfg.call[0]);
        const uint8_t *raw = (const uint8_t *)&gAprsCfg;
        for (unsigned i = 0; i < 16 && n < (int)sizeof(dbg) - 6; i++)
            n += sprintf(dbg + n, " %02X", raw[i]);
        dbg[n++] = '\r';
        dbg[n++] = '\n';
        dbg[n]   = 0;
        VCP_SendStr(dbg);
    }
    if (gAprsCfg.magic != APRS_EE_MAGIC || gAprsCfg.call[0] == 0xFF)
        APRS_Defaults();
    {   /* msg_to is a newer field: an EEPROM written by an older build has
         * junk in those bytes -- accept only a plausible addressee */
        int ok = 1;
        for (int i = 0; i < (int)sizeof gAprsCfg.msg_to; i++) {
            char c = gAprsCfg.msg_to[i];
            if (c == 0) break;
            if (!((c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9') ||
                  c == '-' || c == ' ')) { ok = 0; break; }
        }
        if (!ok) memset(gAprsCfg.msg_to, 0, sizeof gAprsCfg.msg_to);
        gAprsCfg.msg_to[sizeof gAprsCfg.msg_to - 1] = 0;
    }
    APRS_EnsureChannel();
    aprs_refresh_ch_freq();
    s_next_beacon_10ms = millis10() + 6000;   /* first beacon 60 s after boot */
    s_inited = true;
    AFGAIN_ResyncKnob();
    AFGAIN_Apply();
    APRS_PushConfig();   /* the RP2040 has no persistent state of its own --
                          * it needs this after every one of its own reboots,
                          * not only after a menu edit (see APRS_PushConfig()
                          * itself, called there too on save). */
}

/* APRS_Init() is not wired into the boot path; run it lazily the first time
 * anything touches the config (the beacon tick, the screen, an RX frame) so
 * gAprsCfg is never left as zeroed BSS with the EEPROM unread. */
static void APRS_Ensure(void)
{
    if (!s_inited)
        APRS_Init();
}

