f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
static void APRS_Save(void)
{
    gAprsCfg.magic = APRS_EE_MAGIC;
    for (unsigned i = 0; i < sizeof(gAprsCfg); i += 8)
        EEPROM_WriteBuffer(APRS_EE_ADDR + i, (const uint8_t *)&gAprsCfg + i);
}

void APRS_SaveConfig(void) { APRS_Save(); }   /* public wrapper */

/* made non-static by patch/app_uart.c.diff (equivalent), same as sarsat.c */
extern void SendReply(uint32_t Port, void *pReply, uint16_t Size);

/* Push the config to the RP2040: call/ssid (used for traceable digipeating --
 * stamped into a fully-consumed WIDEn-N slot instead of an anonymous
 * "WIDEn-0*", see aprs_digi.h), path/symbol (kept for our own beacon,
 * currently unused RP2040-side) and digi_level. Called on every
 * menu save AND from APRS_Init() -- the RP2040 keeps no state across its own
 * reboots, so it must get this fresh at least once after either side resets,
 * not only when the user happens to touch the menu. No ACK expected (see the
 * file header note). */
static void APRS_PushConfig(void)
{
    uint8_t b[4 + 12];
    b[0] = APRS_CMD_CONFIG & 0xFF; b[1] = APRS_CMD_CONFIG >> 8;
    b[2] = 12;                     b[3] = 0;
    memcpy(b + 4, gAprsCfg.call, 6);
    b[10] = gAprsCfg.ssid;
    b[11] = gAprsCfg.path;
    b[12] = gAprsCfg.sym_table;
    b[13] = gAprsCfg.sym_code;
    b[14] = (uint8_t)((gAprsCfg.opts & APRS_OPT_DIGI_MASK) >> APRS_OPT_DIGI_SHIFT);
    b[15] = (gAprsCfg.opts & APRS_OPT_KISS) ? 0x01 : 0x00;   /* flags: KISS */
    SendReply(UART_PORT_UART, b, sizeof(b));
}

/* ------------------------------------------- GPS fix from the C-Board (0x06D5) */
static struct {
    bool     seen;         /* at least one 0x06D5 frame ever received         */
    bool     valid;
    int32_t  lat_e5, lon_e5;
    uint16_t speed_kmh, course;
    int16_t  alt;
    uint8_t  sats;
    uint32_t at_10ms;
} s_gps;

bool APRS_GpsFixValid(void)
{
    return s_gps.valid && (int32_t)(millis10() - s_gps.at_10ms) < 1500;  /* 15 s */
}

/* top-bar indicator: 0 = no C-Board GPS frames, 1 = module present but no
 * lock (blinks), 2 = locked (solid). The RP2040 sends 0x06D5 ~every 3 s only
 * while a module is actually talking, so "no frame for 15 s" == no GPS. */
uint8_t APRS_GpsState(void)
{
    if (!s_gps.seen || (int32_t)(millis10() - s_gps.at_10ms) >= 1500)
        return 0;
    return s_gps.valid ? 2 : 1;
}

/* the position to beacon / report: a fresh GPS fix if "Pos GPS" is set, else
 * the manually entered lat/lon. */
void APRS_MyPosition(int32_t *lat_e5, int32_t *lon_e5)
{
    if ((gAprsCfg.opts & APRS_OPT_GPS) && APRS_GpsFixValid()) {
        *lat_e5 = s_gps.lat_e5;
        *lon_e5 = s_gps.lon_e5;
    } else {
        *lat_e5 = gAprsCfg.lat_e5;
        *lon_e5 = gAprsCfg.lon_e5;
    }
}

/* ------------------------------------------------------------ APRS strings */
/* "DDMM.mm" (lat: 2 deg digits, lon: 3) into `p`, returns chars written */
static int fmt_dmm(char *p, int32_t e5, int degdigits, char pos, char neg)
{
    uint32_t a  = (e5 < 0) ? -e5 : e5;
    uint32_t d  = a / 100000u;
    uint32_t mmhh = ((a % 100000u) * 60u) / 1000u;   /* MMHH, i.e. min*100  */
    return sprintf(p, degdigits == 3 ? "%03u%02u.%02u%c" : "%02u%02u.%02u%c",
                   (unsigned)d, (unsigned)(mmhh / 100), (unsigned)(mmhh % 100),
                   (e5 < 0) ? neg : pos);
}

static int APRS_FormatPosition(char *info)
{
    int32_t lat, lon;
    APRS_MyPosition(&lat, &lon);
    const bool gps = (gAprsCfg.opts & APRS_OPT_GPS) && APRS_GpsFixValid();

    int n = 0;
    info[n++] = '!';
    n += fmt_dmm(info + n, lat, 2, 'N', 'S');
    info[n++] = gAprsCfg.sym_table;
    n += fmt_dmm(info + n, lon, 3, 'E', 'W');
    info[n++] = gAprsCfg.sym_code;
    /* CSE/SPD data extension (course deg / speed knots) when moving on GPS */
    if (gps && s_gps.speed_kmh > 3)
        n += sprintf(info + n, "%03u/%03u", (unsigned)(s_gps.course % 360u),
                     (unsigned)((s_gps.speed_kmh * 100u + 92u) / 185u));  /* km/h->kn */
    n += sprintf(info + n, "%.*s", (int)sizeof(gAprsCfg.comment),
                 gAprsCfg.comment);
    return n;
}

/* ------------------------------------------------------------ AFSK on air  */
static uint16_t afsk_scale(uint16_t f)
{
    return (uint16_t)((((uint32_t)f * 1353245u) + (1u << 16)) >> 17);
}

/* Inject the Bell-202 AFSK into the carrier that RADIO_SetTxParameters() has
 * already brought up. Same sequence the firmware uses for the roger beep /
 * DTMF-during-TX (BK4819_PlayRogerNormal, BK4819_PlayDTMFEx):
 *   mute -> REG_70 tone1 -> EnableTXLink -> settle -> set REG_71 -> unmute.
 * BK4819_EnableTXLink() is what puts REG_30 into the TX-DSP state with
 * ENABLE_PA_GAIN / ENABLE_PLL_VCO; writing REG_30 by hand without those
 * collapsed the PA ("keys up but nothing radiates") on the V1 port.
 *
 * Timing: BK4819_WriteRegister is a ~40 us bit-banged transfer, so the naive
 * "write REG_71 every bit + delay" loop runs slow and jitters -- unlockable
 * for a real TNC (found on the V1 port). Instead: write REG_71 only on an
 * actual tone change (NRZI runs stay phase-continuous) and clock the bit
 * cells off a free-running SysTick deadline that absorbs the write time and
 * self-corrects for IRQ jitter, so the average stays exactly 1200 baud. */
static void APRS_SendTones(const uint8_t *tones, int nb)
{
    const uint16_t r_mark  = afsk_scale(AFSK_MARK);
    const uint16_t r_space = afsk_scale(AFSK_SPACE);
    const uint32_t reload  = SysTick->LOAD;      /* 479999 (10 ms window)     */

    BK4819_EnterTxMute();
    BK4819_SetAF(BK4819_AF_MUTE);
    BK4819_WriteRegister(BK4819_REG_70,
        BK4819_REG_70_ENABLE_TONE1 |
        (AFSK_TONE_GAIN << BK4819_REG_70_SHIFT_TONE1_TUNING_GAIN));
    BK4819_EnableTXLink();               /* REG_30: TX DSP + PA_GAIN + PLL_VCO */
    SYSTEM_DelayMs(50);

    int cur = tones[0] ? 1 : 0;
    BK4819_WriteRegister(BK4819_REG_71, cur ? r_mark : r_space);
    BK4819_ExitTxMute();

    uint32_t last = SysTick->VAL;        /* SysTick is a 24-bit down-counter  */
    uint32_t acc  = 0;
    for (int i = 0; i < nb; i++) {
        const int want = tones[i] ? 1 : 0;
        if (want != cur) {
            BK4819_WriteRegister(BK4819_REG_71, want ? r_mark : r_space);
            cur = want;
        }
        while (acc < AFSK_TICKS_PER_BIT) {
            const uint32_t now = SysTick->VAL;
            acc += (last >= now) ? (last - now)
                                 : (last + reload + 1 - now);
            last = now;
        }
        acc -= AFSK_TICKS_PER_BIT;       /* carry the remainder to the next bit */
    }

