f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
    BK4819_EnterTxMute();
    BK4819_WriteRegister(BK4819_REG_70, 0x0000);
    BK4819_WriteRegister(BK4819_REG_30, 0xC1FE);   /* carrier, tone off */
}

static int APRS_Digi(ax25_addr_t *d)
{
    switch (gAprsCfg.path) {
    case APRS_PATH_W1:  strcpy(d[0].call, "WIDE1"); d[0].ssid = 1; return 1;
    case APRS_PATH_W2:  strcpy(d[0].call, "WIDE2"); d[0].ssid = 1; return 1;
    case APRS_PATH_W1W2:
        strcpy(d[0].call, "WIDE1"); d[0].ssid = 1;
        strcpy(d[1].call, "WIDE2"); d[1].ssid = 1; return 2;
    default: return 0;
    }
}

/* Key up on channel 170's own config (frequency / power / mode / bandwidth /
 * offset / CTCSS), never on whatever VFO A/B are currently tuned to, send
 * `frame` (flen bytes, FCS already included) as Bell-202 AFSK, then restore
 * the borrowed VFO slot -- shared by APRS_Beacon() (below) and
 * APRS_Digipeat() so both go out identically. Borrow the TX_VFO slot: save
 * its live content, reload it from channel 170 (RADIO_ConfigureChannel(),
 * the same reader the UI uses when switching to a memory channel), key up
 * on that -- same way FUNCTION_Transmit() does: DTMF off (it retunes the TX
 * audio filter), RADIO_SetTxParameters() (frequency + PA + PrepareTransmit),
 * red LED -- then restore the slot exactly as it was before going back to
 * RX. */
static void APRS_TxFrame(const uint8_t *frame, int flen)
{
    static uint8_t tones[AX25_MAX_BITS];
    int nb = ax25_hdlc_nrzi(frame, flen, APRS_TXDELAY_FLAGS, tones);
    if (!nb) return;

    const uint8_t     txv        = gEeprom.TX_VFO;
    const VFO_Info_t  saved_vfo  = gEeprom.VfoInfo[txv];
    const uint8_t     saved_sc   = gEeprom.ScreenChannel[txv];
    const uint8_t     saved_mrc  = gEeprom.MrChannel[txv];

    gEeprom.ScreenChannel[txv] = APRS_TX_CHANNEL;
    RADIO_ConfigureChannel(txv, VFO_CONFIGURE_RELOAD);   /* re-read channel 170
                                                          * from EEPROM -- plain
                                                          * VFO_CONFIGURE would
                                                          * keep the slot's old
                                                          * (borrowed) content */

    RADIO_SelectVfos();
    gCurrentVfo = gTxVfo;
    BK4819_DisableDTMF();
    RADIO_SetTxParameters();
    BK4819_ToggleGpioOut(BK4819_GPIO5_PIN1_RED, true);
    SYSTEM_DelayMs(20);

    APRS_SendTones(tones, nb);

    BK4819_ToggleGpioOut(BK4819_GPIO5_PIN1_RED, false);
    BK4819_ToggleGpioOut(BK4819_GPIO1_PIN29_PA_ENABLE, false);

    gEeprom.VfoInfo[txv]       = saved_vfo;
    gEeprom.ScreenChannel[txv] = saved_sc;
    gEeprom.MrChannel[txv]     = saved_mrc;
    RADIO_SelectVfos();
    RADIO_SetupRegisters(true);          /* back to RX, exactly as before --
                                          * this firmware's version also
                                          * re-runs RADIO_SetModulation(), so
                                          * the AF is un-muted from the AFSK TX */

    /* RADIO_SetupRegisters() put REG_4E back to the channel squelch and reset
     * REG_48. On the APRS band that makes the squelch chop the next packet
     * and the C-Board level wrong -- the 10 ms tick normally re-applies both
     * (APRS_TimeSlice()), but it is blocked whenever this TX fired from
     * APP_RunAprs()'s own loop (report retry / digipeat). Re-apply here so
     * every TX path leaves a clean APRS RX behind. No-ops off-band / auto. */
    RADIO_SetModulation(gRxVfo->Modulation);
    APRS_ApplySquelch();
    APRS_ApplyRxAudio();
    APRS_ApplyAfc();
    AFGAIN_Apply();
}

/* Gates shared by originating a beacon and repeating someone else's frame:
 * never while actually transmitting, never over the SARSAT screen, never
 * while the channel is busy (CSMA -- the caller retries on the next slice
 * for a beacon; a missed digipeat opportunity is simply dropped, which is
 * safe). Beaconing additionally requires a real callsign (never transmit
 * under the NOCALL default) and, in GPS mode, a fresh fix -- digipeating
 * does not: the repeated frame's own source field already identifies the
 * originating station, this radio is only relaying it, not originating it. */
static bool APRS_CanTransmitNow(void)
{
    if (gCurrentFunction == FUNCTION_TRANSMIT)
        return false;
#ifdef ENABLE_SARSAT
    /* Never key up while the SARSAT screen owns the radio: it forces its own
     * FM+WIDE+REG2B receive profile on the currently selected VFO for the
     * C-Board decoder, and a mid-monitoring jump to channel 170 for TX would
     * fight that. In practice APRS_TimeSlice() (the only caller of the
     * auto-beacon path) is not ticked while APP_RunSarsat()'s loop is
     * blocking anyway -- this is belt and suspenders, and covers a future
     * caller too. */
    if (SARSAT_ScreenOpen())
        return false;
#endif
    /* CSMA: never key up while a carrier is present. g_SquelchLost (not
     * gCurrentFunction) is the right test here: per functions.h,
     * FUNCTION_RECEIVE is actually "squelch closed" (idle) and the state
     * that means "a signal is present" is FUNCTION_INCOMING, never tested
     * by the check this replaces. More fundamentally, gCurrentFunction is
     * only updated by the main 10 ms tick, which APP_RunAprs()'s own popup
     * loop blocks for as long as it stays open -- it would sit frozen at
     * whatever it was on entry (almost always mid-reception, since the
     * popup opens ON a decoded packet) regardless of the real channel
     * state. g_SquelchLost stays live in both contexts: normally via that
     * same tick, and inside the popup via its own inline mini-squelch poll
     * (see APP_RunAprs()'s loop) -- the likely cause of "no repetition
     * while the popup is open", reported on air with the previous check. */
    if (g_SquelchLost)
        return false;
    return true;
}

/* Assemble "MYCALL-SSID>APZSAR,<digi...>:<info>" and hand it to APRS_TxFrame().
 * Shared by APRS_Beacon() and APRS_MsgTx(). */
static void APRS_TxInfo(const char *info, int ilen,
                        const ax25_addr_t *digi, int nd)
{
    if (ilen <= 0 || ilen > AX25_MAX_INFO)
        return;

    ax25_addr_t src, dst;
    memset(&src, 0, sizeof src); memset(&dst, 0, sizeof dst);
    memcpy(src.call, gAprsCfg.call, 6); src.ssid = gAprsCfg.ssid;
    strcpy(dst.call, "APZSAR");

    uint8_t frame[AX25_MAX_FRAME];
    int flen = ax25_build_ui(frame, &dst, &src, digi, nd, info, ilen);
    if (flen)
        APRS_TxFrame(frame, flen);
}

void APRS_Beacon(void)
{
    if (gAprsCfg.call[0] == 0 || strcmp(gAprsCfg.call, "NOCALL") == 0)
        return;
    if (!APRS_CanTransmitNow())
        return;

    /* GPS position mode with no fix yet: don't beacon a stale / zero position */
    if ((gAprsCfg.opts & APRS_OPT_GPS) && !APRS_GpsFixValid())
        return;

