f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
    char info[AX25_MAX_INFO + 4];
    int  ilen = APRS_FormatPosition(info);

    ax25_addr_t digi[AX25_MAX_DIGI];
    memset(digi, 0, sizeof digi);
    int nd = APRS_Digi(digi);
    APRS_TxInfo(info, ilen, digi, nd);
}

/* ---- "121 MHz beacon report" APRS message ("Send report" on the screen) --
 * A canned APRS text message to a fixed recipient (gAprsCfg.msg_to) over a
 * fixed WIDE1-1,WIDE2-2 path, for reporting a 121.5 MHz homing bearing:
 *   "Report Balise 121 MHz S: <0-9> Dir: <0-359|KO>"
 * Sent with an APRS message number so the addressee's client auto-acks; we
 * retry up to APRS_MSG_TRIES times, APRS_MSG_RETRY_10MS apart, until that
 * ack comes back (seen through the RP2040's decoded-message push, 0x06D3)
 * or we give up. Progress shows on the F_SEND menu row. Needs the C-Board
 * connected (it is what hears the ack); with no TNC it always ends "no ack". */
#define APRS_MSG_TRIES        3
#define APRS_MSG_RETRY_10MS   3000     /* 30 s between the (re)transmits     */
#define APRS_MSG_WAIT_10MS    30000    /* keep listening for the ack 5 min   */
#define APRS_MSG_DIR_KO       0xFFFFu

enum { APRS_MSG_IDLE = 0, APRS_MSG_WAIT, APRS_MSG_ACK, APRS_MSG_FAIL };
enum { APRS_MSG_K_REPORT = 0, APRS_MSG_K_BEACON };   /* s_msg.kind */

static struct {
    uint8_t  state;               /* APRS_MSG_*                             */
    uint8_t  kind;                 /* APRS_MSG_K_* : 121 report vs SARSAT bcn */
    uint8_t  seq;                 /* APRS message number, cycles 1..99      */
    uint8_t  tries;               /* (re)transmits done so far (max _TRIES) */
    uint8_t  sig;                 /* signal 0..9  (report)                  */
    uint16_t dir;                 /* 0..359, or APRS_MSG_DIR_KO  (report)   */
    uint32_t next_at_10ms;        /* next (re)transmit due                  */
    uint32_t deadline_10ms;       /* declare "no ack" past this             */
} s_msg;

/* Last SARSAT 1G beacon the RP2040 decoded and pushed over 0x06C2. Fed by
 * APRS_NoteBeacon() (called from sarsat.c's SARSAT_CMD_BEACON handler); read
 * by the "Send SARSAT" menu row / APRS_MsgInfo(). */
static struct {
    char     hex_id[16];          /* 15 hex + NUL                           */
    int32_t  lat_e5, lon_e5;      /* degrees x 1e5 (0 if no position)       */
    uint16_t country;
    uint8_t  has_pos;
    uint8_t  is_test;
    uint8_t  valid;
} s_bcn;

void APRS_NoteBeacon(const char *hex_id, int32_t lat_e5, int32_t lon_e5,
                     uint16_t country, uint8_t has_pos, uint8_t is_test)
{
    memset(s_bcn.hex_id, 0, sizeof s_bcn.hex_id);
    for (int i = 0; i < 15 && hex_id[i]; i++) s_bcn.hex_id[i] = hex_id[i];
    s_bcn.lat_e5  = has_pos ? lat_e5 : 0;
    s_bcn.lon_e5  = has_pos ? lon_e5 : 0;
    s_bcn.country = country;
    s_bcn.has_pos = has_pos ? 1 : 0;
    s_bcn.is_test = is_test ? 1 : 0;
    s_bcn.valid   = 1;
}


/* decimal degrees with 4 decimals, signed ("43.9544", "-1.3644") */
static int APRS_Deg4(char *out, int32_t e5)
{
    uint32_t a   = (e5 < 0) ? (uint32_t)(-e5) : (uint32_t)e5;
    uint32_t deg = a / 100000u;
    uint32_t f4  = (a % 100000u + 5u) / 10u;       /* round to 4 dp */
    if (f4 >= 10000u) { deg++; f4 -= 10000u; }
    return sprintf(out, "%s%u.%04u", (e5 < 0) ? "-" : "",
                   (unsigned)deg, (unsigned)f4);
}

static int APRS_MsgInfo(char *info)
{
    char to[10];
    int n = 0;
    for (; n < 9 && gAprsCfg.msg_to[n]; n++) to[n] = gAprsCfg.msg_to[n];
    for (; n < 9; n++) to[n] = ' ';         /* addressee is exactly 9 chars */
    to[9] = 0;

    if (s_msg.kind == APRS_MSG_K_BEACON) {
        char pos[26];
        if (s_bcn.has_pos) {
            int p = APRS_Deg4(pos, s_bcn.lat_e5);
            pos[p++] = ' ';
            APRS_Deg4(pos + p, s_bcn.lon_e5);
        } else {
            strcpy(pos, "NOPOS");
        }
        return sprintf(info, ":%s:SARSAT %.15s %s c%u%s{%02u",
                       to, s_bcn.hex_id, pos, s_bcn.country,
                       s_bcn.is_test ? " TEST" : "", s_msg.seq);
    }

    char dir[8];
    if (s_msg.dir == APRS_MSG_DIR_KO) strcpy(dir, "KO");
    else                             sprintf(dir, "%u", s_msg.dir);

    /* my resolved position (GPS fix if in GPS mode, else the manual lat/lon);
     * appended in decimal degrees only when it is actually set */
    int32_t lat, lon;
    APRS_MyPosition(&lat, &lon);
    char pos[26];
    pos[0] = 0;
    if (lat || lon) {
        int p = sprintf(pos, " ");
        p += APRS_Deg4(pos + p, lat);
        pos[p++] = ' ';
        APRS_Deg4(pos + p, lon);
    }

    return sprintf(info, ":%s:Report Balise 121 MHz S: %u Dir: %s%s{%02u",
                   to, s_msg.sig, dir, pos, s_msg.seq);
}

static void APRS_MsgTx(void)
{
    char info[AX25_MAX_INFO + 8];
    int  ilen = APRS_MsgInfo(info);

    ax25_addr_t digi[2];
    memset(digi, 0, sizeof digi);
    strcpy(digi[0].call, "WIDE1"); digi[0].ssid = 1;   /* fixed WIDE1-1,WIDE2-2 */
    strcpy(digi[1].call, "WIDE2"); digi[1].ssid = 2;
    APRS_TxInfo(info, ilen, digi, 2);
}

/* true if a message can be sent at all (callsign + recipient set) */
static bool APRS_MsgCanSend(void)
{
    return gAprsCfg.call[0] != 0 && strcmp(gAprsCfg.call, "NOCALL") != 0 &&
           gAprsCfg.msg_to[0] > ' ';
}

static void APRS_MsgArm(void)
{
    s_msg.seq   = (uint8_t)(s_msg.seq % 99u) + 1u;
    s_msg.tries = 0;
    s_msg.state = APRS_MSG_WAIT;
    s_msg.next_at_10ms  = millis10();                       /* first TX next slice */
    s_msg.deadline_10ms = millis10() + APRS_MSG_WAIT_10MS;
}

/* begin a 121 MHz report; sig 0 forces "Dir: KO" and the caller skips direction */
static void APRS_MsgStart(uint8_t sig, uint16_t dir)
{
    if (!APRS_MsgCanSend())
        return;
    s_msg.kind  = APRS_MSG_K_REPORT;
    s_msg.sig   = (sig > 9) ? 9 : sig;
    s_msg.dir   = (sig == 0) ? APRS_MSG_DIR_KO : (dir > 359 ? 359 : dir);
    APRS_MsgArm();
}

/* begin a "SARSAT beacon position" report from the last 0x06C2 decode */
static void APRS_MsgStartBeacon(void)
{
    if (!s_bcn.valid || !APRS_MsgCanSend())
        return;
    s_msg.kind = APRS_MSG_K_BEACON;
    APRS_MsgArm();
}

/* pumped from APRS_TimeSlice() and the APP_RunAprs() loop, like digipeat.
 * The 3 (re)transmits go out over the first ~90 s, but we keep the state on
 * WAIT (still matching an incoming ack) until APRS_MSG_WAIT_10MS -- a real
 * APRS ack, digipeated both ways or bounced off an i-gate, routinely takes
 * longer than the retransmit window. */
static void APRS_MsgTimeSlice(void)
{
    if (s_msg.state != APRS_MSG_WAIT)
        return;
    if ((int32_t)(millis10() - s_msg.deadline_10ms) >= 0) {
        s_msg.state = APRS_MSG_FAIL;                        /* no ack, gave up */
        BACKLIGHT_TurnOn();
        return;
    }
    if (s_msg.tries >= APRS_MSG_TRIES)
        return;                                             /* done TXing, listen */
    if ((int32_t)(millis10() - s_msg.next_at_10ms) < 0)
        return;
    if (!APRS_CanTransmitNow())
        return;                                             /* channel busy */
    APRS_MsgTx();
    s_msg.tries++;
    s_msg.next_at_10ms = millis10() + APRS_MSG_RETRY_10MS;
}

