f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
/* an APRS message decoded by the RP2040 (0x06D3): is it our "ackNN"?
 * Accepts a late ack that lands after we already gave up (FAIL -> ACK). */
static void APRS_MsgCheckAck(const char *addressee, const char *text)
{
    if ((s_msg.state != APRS_MSG_WAIT && s_msg.state != APRS_MSG_FAIL) ||
        strncmp(text, "ack", 3) != 0)
        return;

    /* base callsign of the addressee (before '-' / space) must be ours; an
     * SSID that differs or is absent is tolerated (some clients ack the bare
     * call). Trim both sides -- gAprsCfg.call can carry a trailing space from
     * the char-cycle editor. */
    char ab[8], mc[8];
    int i = 0, j = 0;
    for (; i < 6 && addressee[i] > ' ' && addressee[i] != '-'; i++)
        ab[i] = addressee[i];
    ab[i] = 0;
    for (; j < 6 && gAprsCfg.call[j] > ' ' && gAprsCfg.call[j] != '-'; j++)
        mc[j] = gAprsCfg.call[j];
    mc[j] = 0;
    if (ab[0] == 0 || strcmp(ab, mc) != 0)
        return;

    /* "ackNN": accept NN == the current report, OR any earlier number of this
     * session -- retested reports carry the same S/Dir text, so a slow client
     * that keeps re-acking "ack01" (or dedups our retries) still confirms the
     * report was received. Only a number past our current seq is rejected. */
    int no = 0;
    for (const char *q = text + 3; *q >= '0' && *q <= '9'; q++)
        no = no * 10 + (*q - '0');
    if (no >= 1 && no <= s_msg.seq) {
        s_msg.state = APRS_MSG_ACK;
        BACKLIGHT_TurnOn();
    }
}

/* AX25_MAX_FRAME (112 o) is sized for OUR OWN beacon (2 digis, short info) --
 * a frame the RP2040 hands back for digipeating can have a longer path/info
 * than that, up to the 256 o it itself caps at (rp2040/src/main.c). Sized
 * generously enough for real-world APRS traffic without following the
 * RP2040's own much larger internal margin (APRS_RX_MAX_FRAME=330, sized for
 * its own worst-case demod buffer, not for what any real packet needs). A
 * local (stack) buffer, not static -- this firmware's RAM is already tight. */
#define APRS_DIGI_MAX_FRAME (256 + 2)

/* APRS_CMD_DIGI arrives right on the tail of the very burst it repeats --
 * the radio is still virtually guaranteed to be mid-RX/monitor (squelch
 * hang time) at that exact instant, so a single immediate
 * APRS_CanTransmitNow() attempt lost the CSMA race essentially every time
 * (confirmed on air: the RP2040 logged "repeating", nothing went out).
 * APRS_Beacon() dodges this by being retried every ~3 s from
 * APRS_TimeSlice() until the channel clears -- queue the digipeat frame the
 * same way instead of firing it once from APRS_HandleUART(). One slot is
 * enough: digipeat bursts are sparse relative to the ~3 s beacon retry
 * cadence this reuses. */
static struct {
    uint8_t  data[APRS_DIGI_MAX_FRAME - 2];
    uint16_t len;
    bool     pending;
    uint32_t queued_at_10ms;
} s_digi_pending;

#define APRS_DIGI_MIN_DELAY_10MS 30  /* let the channel settle ~300 ms before
                                      * keying up -- avoids clipping the tail
                                      * of the frame just repeated / the
                                      * originating station's own RX turnaround */
#define APRS_DIGI_MAX_AGE_10MS   300 /* give up after ~3 s of a busy channel */

/* APRS_CMD_DIGI: `data` is a raw AX.25 frame (addr..ctrl..pid..info) the
 * RP2040 has already decided is worth repeating and mutated in place
 * (aprs_digi.h on that side) -- FCS is NOT included, APRS_DigipeatTimeSlice()
 * appends it once it actually transmits. No callsign gate: see
 * APRS_CanTransmitNow()'s comment. */
static void APRS_Digipeat(const uint8_t *data, uint16_t size)
{
    if (size < 16 || size > sizeof(s_digi_pending.data))
        return;   /* too short to be a real frame, or too long for our buffer */

    memcpy(s_digi_pending.data, data, size);
    s_digi_pending.len            = size;
    s_digi_pending.pending        = true;
    s_digi_pending.queued_at_10ms = millis10();
}

/* Called every ~10 ms from APRS_TimeSlice(), unconditionally. */
static void APRS_DigipeatTimeSlice(void)
{
    if (!s_digi_pending.pending)
        return;
    int32_t age = (int32_t)(millis10() - s_digi_pending.queued_at_10ms);
    if (age > APRS_DIGI_MAX_AGE_10MS) {
        s_digi_pending.pending = false;   /* channel stayed busy too long: a
                                           * stale repeat is worse than none */
        return;
    }
    if (age < APRS_DIGI_MIN_DELAY_10MS)
        return;                           /* still settling, try again next tick */
    if (!APRS_CanTransmitNow())
        return;                           /* try again next tick */

    s_digi_pending.pending = false;
    uint8_t frame[APRS_DIGI_MAX_FRAME];
    memcpy(frame, s_digi_pending.data, s_digi_pending.len);
    uint16_t fcs = ax25_fcs(frame, s_digi_pending.len);
    frame[s_digi_pending.len]     = (uint8_t)(fcs & 0xFF);
    frame[s_digi_pending.len + 1] = (uint8_t)(fcs >> 8);

    APRS_TxFrame(frame, s_digi_pending.len + 2);
}

/* SmartBeaconing profiles -- {low, high, slow, fast, turn_min, turn_slope,
 * turn_time}, speeds km/h, angles deg, times s.  Row 0 = car, 1 = on foot.
 * `slow` doubles as the fallback fixed period when GPS is unavailable.        */
static const uint16_t s_sb_prof[2][7] = {
    {    5,   90, 1200,   30,    25,     255,     25 },   /* car    */
    {    2,    8,  600,   90,    35,      80,     45 },   /* on foot */
};
#define APRS_SB_ROW  (gAprsCfg.interval_s == APRS_SB_FOOT)

/* SmartBeaconing (HamHUD-style): variable beacon rate from GPS speed, plus
 * "corner pegging" -- an extra beacon when the course changes by more than a
 * speed-dependent threshold. Returns true when a beacon is due now; latches
 * its own timing.  Only called while a live GPS fix is available.            */
static bool APRS_SmartBeaconDue(void)
{
    static uint32_t last_10ms;
    static uint16_t last_course;

    const uint16_t *p = s_sb_prof[APRS_SB_ROW];
    uint16_t v   = s_gps.speed_kmh;
    uint16_t sec = (uint16_t)((millis10() - last_10ms) / 100u);

