f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
    uint16_t rate = (v <= p[0]) ? p[2]
                  : (v >= p[1]) ? p[3]
                  : (uint16_t)((uint32_t)p[3] * p[1] / v);

    bool due = sec >= rate;

    if (!due && v > p[0] && sec >= p[6]) {           /* corner pegging */
        int16_t dc = (int16_t)((int16_t)s_gps.course - (int16_t)last_course);
        if (dc < -180) dc += 360; else if (dc > 180) dc -= 360;
        if (dc < 0) dc = (int16_t)-dc;
        if (dc >= (int16_t)(p[4] + p[5] / v))
            due = true;
    }

    if (due) { last_10ms = millis10(); last_course = s_gps.course; }
    return due;
}

void APRS_TimeSlice(void)
{
    APRS_Ensure();

    /* ⚠️ FIX (2026-09-12, on user report): CMD_APRS_CONFIG (call/ssid/path/
     * symbol/digi level/KISS flag) used to be pushed to the RP2040 exactly
     * ONCE per boot -- from APRS_Init(), itself only run lazily the first
     * time anything touches the APRS subsystem, guarded by `s_inited` so it
     * never fires again on its own -- plus on an explicit menu-edit save.
     * The RP2040 keeps no config state of its own across ITS OWN reboots
     * either (see APRS_PushConfig()'s comment), so if that one push is
     * ever missed (e.g. sent before the RP2040's own UART receiver is even
     * up yet, a real possibility since the two boot independently) or
     * corrupted on the wire, nothing ever resends it -- the radio's menu
     * keeps showing "KISS: ON" (that only reads gAprsCfg, this station's
     * own local copy) while the RP2040 is silently still sitting on
     * whatever it defaulted to at its own boot (KISS off), with no visible
     * error either side. Symptom reported: KISS shows ON after a power
     * cycle but doesn't actually pass traffic until the user re-enters the
     * menu and toggles it off then on -- which works only because an edit
     * always re-pushes, not because anything about the toggle itself
     * matters. Fixed at the root instead of chasing that one flag: re-push
     * the whole config periodically (~3 s, arbitrary -- fast enough that a
     * missed boot-time push self-heals almost immediately, cheap enough
     * for a single 16-byte UART write while nothing has changed) instead
     * of relying on a single one-shot event with no retry. Kept in sync
     * with V1's identical fix. */
    {
        static uint32_t s_next_cfg_push_10ms;
        if ((int32_t)(millis10() - s_next_cfg_push_10ms) >= 0) {
            APRS_PushConfig();
            s_next_cfg_push_10ms = millis10() + 300;   /* ~3 s */
        }
    }

    /* KISS TNC: the RP2040 (on its USB) is the TNC. The radio only keeps the
     * fast-squelch on, the C-Board AF level applied, and relays the frames the
     * host asks to send (APRS_DigipeatTimeSlice, fed by CMD_APRS_DIGI) -- no
     * own beacon / "121 MHz report" / RX popup. */
    const bool kiss = (gAprsCfg.opts & APRS_OPT_KISS) != 0;

    /* Force out of battery-save on the APRS band. The gSchedulePowerSave
     * inhibit (app/app.c, APRS_KeepAwake()) stops us ENTERING it, but if the
     * radio was already dozing when it landed on 144.8 (or a Dual-Watch
     * half-cycle slipped through before the inhibit tightened), a packet
     * arriving now would only half-wake the RX. Kick it awake here. */
    if (gCurrentFunction == FUNCTION_POWER_SAVE && APRS_KeepAwake())
        FUNCTION_Select(FUNCTION_FOREGROUND);

    APRS_ApplySquelch();               /* APRS-band fast-squelch (cheap: 1 reg read) */
    APRS_ApplyRxAudio();               /* APRS-band: keep the RX audio profile FLAT */
    APRS_ApplyAfc();                   /* APRS-band: restrict AFC excursion range   */
    AFGAIN_TimeSlice();                /* keep a fixed C-Board AF gain in effect
                                        * everywhere, screen open or not     */
    APRS_DigipeatTimeSlice();          /* retry a queued frame until the channel
                                        * is clear -- also the KISS TX path   */
    if (kiss)
        return;
    APRS_MsgTimeSlice();               /* retry the "121 MHz report" message
                                        * until its ack comes back            */

    /* "light on frame", background RX (no popup open, e.g. popup disabled or
     * in its post-close cooldown): keep reasserting the backlight for a
     * short window after each decode -- see s_bl_on_until_10ms's comment. */
    if (s_bl_on_until_10ms && (int32_t)(millis10() - s_bl_on_until_10ms) < 0)
        BACKLIGHT_TurnOn();

    /* "light on frame": kill the backlight ~1 s after an auto-popup closes so
     * the screen goes dark again between packets instead of holding the full
     * backlight time. Armed on the popup's exit; cleared by a fresh frame. */
    if (s_bl_off_10ms && (int32_t)(millis10() - s_bl_off_10ms) >= 0) {
        s_bl_off_10ms = 0;
        if (gScreenToDisplay == DISPLAY_MAIN)
            BACKLIGHT_TurnOff();
    }

    /* keep the top-bar GPS symbol animated: redraw the status line on any
     * state change, and ~2x/s while "searching" so it blinks. */
    {
        static uint8_t s_gps_shown, s_gps_blink;
        uint8_t g = APRS_GpsState();
        if (g != s_gps_shown) { s_gps_shown = g; gUpdateStatus = true; }
        if (g == 1 && (uint8_t)(millis10() - s_gps_blink) >= 25) {
            s_gps_blink = (uint8_t)millis10();
            gUpdateStatus = true;
        }
    }

    if (gAprsCfg.interval_s == 0)
        return;

    const bool sb      = APRS_SB_IS(gAprsCfg.interval_s);
    const bool sb_live = sb && (gAprsCfg.opts & APRS_OPT_GPS) && APRS_GpsFixValid();

    /* SmartBeaconing with no live GPS fix (position set to manual, or GPS mode
     * still searching) falls back to a plain fixed beacon at the profile's
     * slow rate. APRS_Beacon()'s own guard still blocks a zero-position GPS
     * beacon, so "manual + valid lat/lon" keeps working and "GPS + no fix"
     * stays silent. */
    if (!sb_live && (int32_t)(millis10() - s_next_beacon_10ms) < 0)
        return;

    /* channel busy (RX in progress) or already transmitting: hold off ~3 s on
     * the timed paths; live SmartBeaconing just re-checks on the next tick */
    if (gCurrentFunction == FUNCTION_TRANSMIT ||
        gCurrentFunction == FUNCTION_RECEIVE  ||
        gCurrentFunction == FUNCTION_MONITOR) {
        if (!sb_live)
            s_next_beacon_10ms = millis10() + 300;
        return;
    }

