f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
    if (sb_live) {
        if (!APRS_SmartBeaconDue())       /* latches its own timing on a yes   */
            return;
    } else {
        uint16_t period = sb ? s_sb_prof[APRS_SB_ROW][2]   /* SB fallback: slow rate */
                             : gAprsCfg.interval_s;
        s_next_beacon_10ms = millis10() + (uint32_t)period * 100u;
    }
    APRS_Beacon();
}

/* Channel 170's RX frequency, cached: SETTINGS_FetchChannelFrequency() reads
 * EEPROM and aprs_vfo_is_aprs() runs every tick. Refreshed by APRS_Init() and
 * by APP_RunAprs() when it borrows the channel. */
static uint32_t s_aprs_ch_freq = APRS_DEFAULT_FREQ;

static void aprs_refresh_ch_freq(void)
{
    uint32_t f = SETTINGS_FetchChannelFrequency(APRS_TX_CHANNEL);
    if (f > 1000000u && f < 100000000u)          /* sane, not blank 0xFFFFFFFF */
        s_aprs_ch_freq = f;
}

/* Is VFO `v` in "APRS mode"?  Memory mode: only the dedicated APRS channel
 * (MR 170). VFO mode: only tuned exactly to channel 170's frequency -- NOT
 * the whole 144-148 MHz band (so 145.500 simplex etc. is untouched). */
static bool aprs_vfo_is_aprs(unsigned int v)
{
    const uint16_t sc = gEeprom.ScreenChannel[v & 1u];
    if (IS_MR_CHANNEL(sc))
        return sc == APRS_TX_CHANNEL;
    return gEeprom.VfoInfo[v & 1u].freq_config_RX.Frequency == s_aprs_ch_freq;
}

static bool aprs_on_band(void)
{
    return aprs_vfo_is_aprs(gEeprom.RX_VFO & 1u);
}

static void aprs_rx_arrived(void)      /* common: count + rate-limited popup */
{
    if (gAprsCfg.opts & APRS_OPT_KISS)  /* KISS: no display push, guard anyway */
        return;
    s_rx_pkts++;
    s_rx_dirty = true;
    if (gAprsCfg.opts & APRS_OPT_BL_DECODE) {  /* a decoded frame lights the screen */
        BACKLIGHT_TurnOn();
        s_bl_off_10ms     = 0;                 /* cancel a pending post-popup dim */
        s_bl_on_until_10ms = millis10() + 150; /* ~1.5 s -- APRS_TimeSlice() keeps
                                                 * reasserting it until then, see
                                                 * s_bl_on_until_10ms's comment */
    }
    if (gAprsCfg.popup_s != 0 &&
        (int32_t)(millis10() - s_autopop_block_10ms) >= 0)
        gAprsShowRequest = true;
}

/* Called from APP_StartListening (very hot): on the APRS band with the
 * "light on frame" option set, the RX-squelch backlight is suppressed -- only
 * aprs_rx_arrived() lights it. Safe before APRS_Init() (gAprsCfg is zeroed). */
bool APRS_QuietBacklight(void)
{
    /* "Light on frame" is meant to pair with the RX popup (dim between
     * packets, light on a decode, matching the popup opening) -- it used to
     * apply band-wide regardless of the Popup setting, so turning popups
     * OFF while leaving this toggled on left the backlight quiet on plain
     * squelch-open forever, with no popup ever there to justify it. Now
     * tied to popup_s != 0 too: with popups off, stock RX backlight is
     * restored, whatever this toggle says. */
    return (gAprsCfg.opts & APRS_OPT_BL_DECODE) && gAprsCfg.popup_s != 0 &&
           aprs_on_band();
}

/* Block the battery-save on the APRS band: FUNCTION_POWER_SAVE cycles the
 * receiver off (BK4819_Sleep(), RX GPIO low), which chops the audio the
 * C-Board needs -- a packet landing mid-doze only wakes the RX partway
 * through, so the FIRST frame after a quiet spell is lost and the next one
 * decodes ("il faut une premiere trame non decodee pour en recevoir une").
 * Wired into the gSchedulePowerSave inhibit list in app/app.c.
 *
 * Checks BOTH VFOs, not just the current gEeprom.RX_VFO: in Dual Watch
 * RX_VFO alternates, so a plain aprs_on_band() would leave power-save free
 * to trigger during the half-cycle the scanner sits on the other VFO. (Dual
 * Watch still only listens to 144.8 ~half the time -- for reliable APRS RX
 * use Main Only -- but at least the receiver never fully sleeps.) */
bool APRS_KeepAwake(void)
{
    return aprs_vfo_is_aprs(0) || aprs_vfo_is_aprs(1);
}

/* APRS-band "fast squelch" (REG_4E): the stock BK4819 setup uses a long
 * squelch OPEN delay (bits 13:11), so the receiver takes tens of ms to
 * un-mute and the first AX.25 flags of a packet are lost. On 144-148 MHz set:
 *   - open  delay 0 (bits 13:11) -> un-mutes on the first flag
 *   - close delay 3 = max (bits 10:9) -> once open it HOLDS through the packet
 * (a close delay of 1 let the squelch snap shut on the brief amplitude dips
 * inside an AFSK burst on the V1 port -- every chatter blanks ~10-20 ms =
 * 12-24 bits, wrecking the HDLC framing; kept at 3 here from the start).
 * Re-asserted every tick because a VFO re-config rewrites REG_4E. Only
 * touches the two delay fields, not the RSSI/noise/glitch thresholds -- the
 * same narrow slice the V1 port validated on air. (An earlier V3-only attempt
 * also cleared REG_4E bit 8 to match the V1 bit-for-bit; reverted with the
 * rest of the RX-alignment experiments when the operator lost all decode.) */
void APRS_ApplySquelch(void)
{
    if (((gAprsCfg.opts & APRS_OPT_SQL_MASK) >> APRS_OPT_SQL_SHIFT) == 0 ||
        !aprs_on_band())
        return;
    uint16_t r = BK4819_ReadRegister(BK4819_REG_4E);
    uint16_t want = (uint16_t)((r & ~0x3E00u) | (0u << 11) | (3u << 9));
    if (want != r)
        BK4819_WriteRegister(BK4819_REG_4E, want);
}

/* ⚠️ NEW (2026-09-17, explicit user request -- "le mode rapide peut etre
 * bien pour l'APRS?", clarified as: narrow the AFC excursion RANGE, not
 * disable it outright). NOT the same test as the removed APRS_DisableAfc()
 * mentioned in the comment below -- that one turned AFC fully OFF, tried on
 * air, found to make no difference (the residual errors were shown to be
 * RF-domain noise, not LO drift) and removed at the user's request. This is
 * a narrower, weaker intervention: REG_73<13:11> "AFC Range Selection" (per
 * the official Beken datasheet) restricted to 111 = minimum -- AFC stays
 * ACTIVE and can still center a genuine carrier offset, it just can't drift
 * far chasing a transient burst/noise excursion. Same register, same value
 * already applied to SARSAT and VFO RAW earlier this session (there AFC was
 * since fully disabled instead -- this is a fresh, separate test for APRS,
 * not an extension of that). Re-asserted every tick like APRS_ApplySquelch()
 * -- a VFO re-config can reset REG_73 to its chip default (000 = max) just
 * like it does REG_4E. Off-band / no-op cheap check, same pattern. */
void APRS_ApplyAfc(void)
{
    if (!aprs_on_band())
        return;
    uint16_t r = BK4819_ReadRegister(0x73);
    uint16_t want = (uint16_t)((r & ~(0x7u << 11)) | (0x7u << 11));
    if (want != r)
        BK4819_WriteRegister(0x73, want);
}

/* Intentionally INERT (2026-09-09).
 *
 * This used to force a batch of RX-chain registers (0x54/0x55, 0x43, 0x7B,
 * 0x49, 0x2B de-emphasis bypass, 0x2A) on the APRS band, trying to make the
 * BK4829 chain bit-identical to the BK4819 of the UV-K5 V1 (which decodes
 * APRS better). On air the accumulated set killed decoding entirely, so the
 * whole batch was reverted -- the V3 APRS RX path is now exactly what stock
 * F4HWN gives (RADIO_SetModulation + RADIO_SetupRegisters), same philosophy
 * as the V1 (which forces nothing here beyond APRS_ApplySquelch's open delay).
 *
 * Kept as a no-op so the call sites and aprs.h need no edit; re-add
 * individual register writes here, ONE at a time with an on-air check, if a
 * specific one is ever shown to help. The register-by-register comparison is
 * in patch/integration.md. */
void APRS_ApplyRxAudio(void)
{
}

