f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
/* NB: a TEST that kept the BK4829 AFC forced OFF on 144-148 MHz used to live
 * here (APRS_DisableAfc(), reasserted every tick like APRS_ApplySquelch()).
 * It mirrored the fix confirmed on air for the SARSAT screen, but on air it
 * made no difference to APRS decoding -- the residual bit errors were shown
 * to be RF-domain (noisier discriminator on this bench), not an LO drift --
 * so it was removed on the user's request. The AFC is back to its stock
 * MODULATION_FM behaviour (enabled), same as the V1 port. */

static int16_t rd16(const uint8_t *p) { return (int16_t)(p[0] | (p[1] << 8)); }
static int32_t rd32(const uint8_t *p)
{
    return (int32_t)(p[0] | (p[1] << 8) | (p[2] << 16) | ((uint32_t)p[3] << 24));
}
static const uint8_t *rd_str(const uint8_t *p, const uint8_t *end,
                             char *out, int cap)
{
    int k = 0;
    while (p < end && *p) {                        /* consume the whole string */
        if (k < cap - 1) out[k++] = (char)*p;      /* ...even if it overflows  */
        p++;
    }
    out[k] = 0;
    return (p < end) ? p + 1 : end;               /* skip the NUL */
}

/* --------------------------------------------- RX from the RP2040 (0x06Dx) */
void APRS_HandleUART(uint16_t id, const uint8_t *data, uint16_t size)
{
    APRS_Ensure();

    /* suppress a spurious mic-line PTT while the C-Board pushes the packet
     * (a few-ms key-up was seen right after an APRS decode on 144.8, on the
     * V1 port) */
    gSerialConfigCountDown_500ms = 2;

    if (id == APRS_CMD_RXINFO && size >= 22) {
        const uint8_t *p = data, *end = data + size;
        s_rxi.kind    = p[0];
        s_rxi.flags   = p[1];
        s_rxi.sym_t   = (char)p[2];
        s_rxi.sym_c   = (char)p[3];
        s_rxi.lat     = rd32(p + 4);
        s_rxi.lon     = rd32(p + 8);
        s_rxi.course  = (uint16_t)rd16(p + 12);
        s_rxi.speed   = (uint16_t)rd16(p + 14);
        s_rxi.alt     = rd16(p + 16);
        s_rxi.dist_hm = (uint16_t)rd16(p + 18);
        s_rxi.bearing = (uint16_t)rd16(p + 20);
        p += 22;
        p = rd_str(p, end, s_rxi.src,  sizeof s_rxi.src);
        p = rd_str(p, end, s_rxi.name, sizeof s_rxi.name);
        p = rd_str(p, end, s_rxi.via,  sizeof s_rxi.via);
        p = rd_str(p, end, s_rxi.text, sizeof s_rxi.text);
        s_rxi.at_10ms = millis10();
        s_rxi.valid   = true;
        s_rxn = 0;                                 /* the text fallback is stale */
        if (s_rxi.kind == APRS_RX_KIND_MESSAGE)
            APRS_MsgCheckAck(s_rxi.name, s_rxi.text);
        if (s_rxi.flags & 0x10) {                  /* ADRASEC position request */
            s_adr.lat     = s_rxi.lat;
            s_adr.lon     = s_rxi.lon;
            s_adr.dist_hm = s_rxi.dist_hm;
            s_adr.brg     = s_rxi.bearing;
            s_adr.hasd    = (s_rxi.flags & 8) ? 1 : 0;
            memcpy(s_adr.src, s_rxi.src, sizeof s_adr.src);
            s_adrasec        = true;
            gAprsShowRequest = true;               /* open regardless of popup_s */
        }
        aprs_rx_arrived();
        return;
    }

    if (id == APRS_CMD_GPS && size >= 15) {
        s_gps.seen      = true;
        s_gps.valid     = (data[0] & 1u) != 0;
        s_gps.lat_e5    = rd32(data + 1);
        s_gps.lon_e5    = rd32(data + 5);
        s_gps.speed_kmh = (uint16_t)rd16(data + 9);
        s_gps.course    = (uint16_t)rd16(data + 11);
        s_gps.alt       = rd16(data + 13);
        s_gps.sats      = (size >= 16) ? data[15] : 0;
        s_gps.at_10ms   = millis10();
        return;
    }

    if (id == APRS_CMD_RXTEXT && size >= 1) {
        uint8_t line = data[0];
        if (line == 0xFF) { s_rxn = 0; s_rxi.valid = false; s_rx_dirty = true; return; }
        if (line >= 4) return;
        uint16_t n = size - 1;
        if (n > APRS_RX_CHARS) n = APRS_RX_CHARS;
        memset(s_rx[line], 0, sizeof(s_rx[line]));
        memcpy(s_rx[line], data + 1, n);
        if (line + 1 > s_rxn) s_rxn = line + 1;
        if (line == 0) { s_rxi.valid = false; aprs_rx_arrived(); }
        else s_rx_dirty = true;
        return;
    }

    if (id == APRS_CMD_DIGI) {
        APRS_Digipeat(data, size);
        return;
    }
}

/* SetNav (menu Service) : sur l'UV-K1 les touches physiques UP/DOWN sont
 * etiquetees LEFT/RIGHT et le firmware inverse deja partout ailleurs
 * (App/app/menu.c, main.c, scanner.c, spectrum.c...) le sens de UP/DOWN
 * quand gEeprom.SET_NAV est faux (defaut sur UV-K1, cf. App/settings.c) --
 * on suit la meme convention ici pour que l'ecran config APRS navigue dans
 * le meme sens que le reste du firmware sur ce boitier. */
static KEY_Code_t nav_key(KEY_Code_t k)
{
    if (gEeprom.SET_NAV || (k != KEY_UP && k != KEY_DOWN))
        return k;
    return (k == KEY_UP) ? KEY_DOWN : KEY_UP;
}

/* ---------------------------------------------------------- config screen  */
enum { F_CALL, F_SSID, F_PATH, F_SYM, F_TEXT, F_INT, F_POPUP, F_AFGAIN, F_SQL,
       F_BLIGHT, F_DIGI, F_POS, F_LAT, F_LON, F_MSGTO, F_SEND, F_SENDB, F_KISS, F_N };

/* char cycling for the keypad-poor text fields: space, A-Z, 0-9, then a few
 * punctuation marks for the comment. */
static const char CALLSET[] = " ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789";
static const char TEXTSET[] = " ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789-_./+";
static const char ADDRSET[] = " ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789-";
static char cyc_char(char c, int dir, const char *set)
{
    const char *p = strchr(set, (c == 0) ? ' ' : c);
    int n = (int)strlen(set);
    int i = p ? (int)(p - set) : 0;
    return set[(i + dir + n) % n];
}
static const char *const PATHS[] = { "none", "WIDE1-1", "WIDE2-1", "WIDE1+2" };
/* a few common symbols: code, label */
static const struct { char t, c; const char *n; } SYMS[] = {
    { '/', '>', "car"    }, { '/', '-', "house"  }, { '/', 'k', "truck" },
    { '/', '[', "runner" }, { '/', 'b', "bike"   }, { '/', 'Y', "yacht" },
    { '/', '\'',"plane"  }, { '/', '_', "wx"     }, { '/', '.', "dot"   },
    { '/', '#', "digi"   },   /* green star -- APRS digipeater */
};
#define NSYM (int)(sizeof(SYMS)/sizeof(SYMS[0]))

static int sym_index(void)
{
    for (int i = 0; i < NSYM; i++)
        if (SYMS[i].t == gAprsCfg.sym_table && SYMS[i].c == gAprsCfg.sym_code)
            return i;
    return 0;
}

static void field_str(int f, char *out)
{
    switch (f) {
    case F_CALL: sprintf(out, "Call  %s", gAprsCfg.call); break;
    case F_SSID: sprintf(out, "SSID  %u", gAprsCfg.ssid); break;
    case F_PATH: sprintf(out, "Path  %s", PATHS[gAprsCfg.path < APRS_PATH_N ?
                                                gAprsCfg.path : 0]); break;
    case F_SYM:  sprintf(out, "Icon  %s", SYMS[sym_index()].n); break;
    case F_TEXT: sprintf(out, "Txt %.14s",
                         gAprsCfg.comment[0] ? gAprsCfg.comment : "(empty)"); break;
    case F_INT:
        if      (gAprsCfg.interval_s == 0)            strcpy(out, "Interval OFF");
        else if (gAprsCfg.interval_s == APRS_SB_CAR)  strcpy(out, "Interval SB car");
        else if (gAprsCfg.interval_s == APRS_SB_FOOT) strcpy(out, "Interval SB foot");
        else sprintf(out, "Interval %us", gAprsCfg.interval_s);
        break;
    case F_POPUP:
        if (gAprsCfg.popup_s == 0) strcpy(out, "Popup OFF");
        else sprintf(out, "Popup %us", gAprsCfg.popup_s);
        break;
    case F_AFGAIN:
        if (gAfGain < 1 || gAfGain > 78) strcpy(out, "AF gain auto");
        else sprintf(out, "AF gain %u", gAfGain);
        break;
    case F_SQL: strcpy(out,
        ((gAprsCfg.opts & APRS_OPT_SQL_MASK) >> APRS_OPT_SQL_SHIFT)
            ? "Squelch fast" : "Squelch stock"); break;
    case F_BLIGHT: strcpy(out, (gAprsCfg.opts & APRS_OPT_BL_DECODE)
        ? "Light on frame" : "Light on RX"); break;
    case F_DIGI: {
        static const char *const D[] = { "Digi  off", "Digi  WIDE1",
                                          "Digi  WIDE1+2", "Digi  WIDE1+2+3" };
        uint8_t lv = (gAprsCfg.opts & APRS_OPT_DIGI_MASK) >> APRS_OPT_DIGI_SHIFT;
        strcpy(out, D[lv <= 3 ? lv : 0]);
        break;
    }
    case F_POS:
        if (!(gAprsCfg.opts & APRS_OPT_GPS)) strcpy(out, "Pos   manual");
        else if (APRS_GpsFixValid())  sprintf(out, "Pos   GPS %usat", s_gps.sats);
        else                          strcpy(out, "Pos   GPS nofix");
        break;
    case F_LAT: {
        long v = gAprsCfg.lat_e5, a = v < 0 ? -v : v;
        sprintf(out, "Lat  %s%ld.%05lu", v < 0 ? "-" : "",
                (long)(a / 100000), (unsigned long)(a % 100000));
        break;
    }
    case F_LON: {
        long v = gAprsCfg.lon_e5, a = v < 0 ? -v : v;
        sprintf(out, "Lon  %s%ld.%05lu", v < 0 ? "-" : "",
                (long)(a / 100000), (unsigned long)(a % 100000));
        break;
    }
    case F_MSGTO:
        sprintf(out, "To  %.9s", gAprsCfg.msg_to[0] > ' ' ? gAprsCfg.msg_to : "(none)");
        break;
    case F_SEND:
        /* show the message number so the operator can match it to the "ackNN" */
        if (s_msg.state != APRS_MSG_IDLE && s_msg.kind == APRS_MSG_K_REPORT) {
            switch (s_msg.state) {
            case APRS_MSG_WAIT:
                sprintf(out, s_msg.tries < APRS_MSG_TRIES ? "Rpt #%02u TX %u/3"
                                                          : "Rpt #%02u wait ack",
                        s_msg.seq, s_msg.tries);
                break;
            case APRS_MSG_ACK:  sprintf(out, "Rpt #%02u ACK OK", s_msg.seq); break;
            case APRS_MSG_FAIL: sprintf(out, "Rpt #%02u no ack", s_msg.seq); break;
            }
        } else {
            strcpy(out, "Send report");
        }
        break;
    case F_SENDB:
        if (!s_bcn.valid) { strcpy(out, "SARSAT: no bcn"); break; }
        if (s_msg.state != APRS_MSG_IDLE && s_msg.kind == APRS_MSG_K_BEACON) {
            switch (s_msg.state) {
            case APRS_MSG_WAIT:
                sprintf(out, s_msg.tries < APRS_MSG_TRIES ? "Bcn #%02u TX %u/3"
                                                          : "Bcn #%02u wait ack",
                        s_msg.seq, s_msg.tries);
                break;
            case APRS_MSG_ACK:  sprintf(out, "Bcn #%02u ACK OK", s_msg.seq); break;
            case APRS_MSG_FAIL: sprintf(out, "Bcn #%02u no ack", s_msg.seq); break;
            }
        } else {
            sprintf(out, "Send SARSAT %.4s", s_bcn.hex_id);
        }
        break;
    case F_KISS:
        strcpy(out, (gAprsCfg.opts & APRS_OPT_KISS) ? "KISS TNC on"
                                                    : "KISS TNC off");
        break;
    }
}

