f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
/* --- keypad digit entry for Lat / Lon ------------------------------------- */
static char s_kbuf[8];      /* typed digits, degrees then fraction           */
static int  s_klen;
static int  s_kneg;         /* 1 = S / W                                     */

static void kbuf_render(char *out, int degdigits)
{
    int p = 0;
    out[p++] = s_kneg ? '-' : '+';
    for (int i = 0; i < degdigits + 5; i++) {
        if (i == degdigits) out[p++] = '.';
        out[p++] = (i < s_klen) ? s_kbuf[i] : '_';
    }
    out[p] = 0;
}

static void kbuf_commit(int f)
{
    if (s_klen == 0)
        return;
    int  degdigits = (f == F_LAT) ? 2 : 3;
    long deg = 0, frac = 0, mul = 10000;
    int  i = 0;
    for (; i < s_klen && i < degdigits; i++) deg = deg * 10 + (s_kbuf[i] - '0');
    for (; i < s_klen && mul > 0; i++) { frac += (s_kbuf[i] - '0') * mul; mul /= 10; }
    long e5 = deg * 100000 + frac;
    if (s_kneg) e5 = -e5;
    if (f == F_LAT) {
        if (e5 >  9000000) e5 =  9000000;
        if (e5 < -9000000) e5 = -9000000;
        gAprsCfg.lat_e5 = e5;
    } else {
        if (e5 >  18000000) e5 =  18000000;
        if (e5 < -18000000) e5 = -18000000;
        gAprsCfg.lon_e5 = e5;
    }
}

static void field_step(int f, int dir)
{
    static const uint16_t INTS[] = { 0, APRS_SB_CAR, APRS_SB_FOOT,
                                     30, 60, 120, 300, 600, 900, 1800 };
    switch (f) {
    case F_SSID: gAprsCfg.ssid = (gAprsCfg.ssid + dir + 16) & 15; break;
    case F_PATH: gAprsCfg.path = (gAprsCfg.path + dir + APRS_PATH_N) % APRS_PATH_N; break;
    case F_SYM: {
        int i = (sym_index() + dir + NSYM) % NSYM;
        gAprsCfg.sym_table = SYMS[i].t; gAprsCfg.sym_code = SYMS[i].c; break;
    }
    case F_INT: {
        int i = 0, n = (int)(sizeof(INTS)/sizeof(INTS[0]));
        for (; i < n; i++) if (INTS[i] == gAprsCfg.interval_s) break;
        i = (i + dir + n) % n;
        gAprsCfg.interval_s = INTS[i];
        break;
    }
    case F_POPUP: {
        static const uint8_t P[] = { 0, 5, 10, 20 };
        int i = 0, n = (int)(sizeof(P)/sizeof(P[0]));
        for (; i < n; i++) if (P[i] == gAprsCfg.popup_s) break;
        if (i >= n) i = 0;
        gAprsCfg.popup_s = P[(i + dir + n) % n];
        break;
    }
    case F_AFGAIN: {
        int v = (gAfGain >= 1 && gAfGain <= 78) ? gAfGain : 0;   /* 0 = auto */
        v += dir;
        if (v < 0)  v = 0;
        if (v > 78) v = 78;
        gAfGain = (uint8_t)v;
        AFGAIN_Apply();                    /* live */
        break;
    }
    case F_SQL:
        gAprsCfg.opts ^= (1u << APRS_OPT_SQL_SHIFT);   /* toggle stock <-> fast */
        APRS_ApplySquelch();
        break;
    case F_BLIGHT: gAprsCfg.opts ^= APRS_OPT_BL_DECODE; break;
    case F_KISS:   gAprsCfg.opts ^= APRS_OPT_KISS; APRS_PushConfig(); break;
    case F_DIGI: {
        uint8_t lv = (gAprsCfg.opts & APRS_OPT_DIGI_MASK) >> APRS_OPT_DIGI_SHIFT;
        lv = (uint8_t)((lv + dir + 4) % 4);
        gAprsCfg.opts = (uint8_t)((gAprsCfg.opts & ~APRS_OPT_DIGI_MASK) |
                                  (lv << APRS_OPT_DIGI_SHIFT));
        break;
    }
    case F_POS:    gAprsCfg.opts ^= APRS_OPT_GPS; break;   /* manual <-> GPS */
    case F_LAT:
        gAprsCfg.lat_e5 += dir * 100;  /* 0.001 deg step */
        if (gAprsCfg.lat_e5 >  9000000) gAprsCfg.lat_e5 =  9000000;
        if (gAprsCfg.lat_e5 < -9000000) gAprsCfg.lat_e5 = -9000000;
        break;
    case F_LON:
        gAprsCfg.lon_e5 += dir * 100;
        if (gAprsCfg.lon_e5 >  18000000) gAprsCfg.lon_e5 =  18000000;
        if (gAprsCfg.lon_e5 < -18000000) gAprsCfg.lon_e5 = -18000000;
        break;
    }
}

/* The LCD content area is only 7 rows (gFrameBuffer[0..6]; row 0 of the panel
 * is the separate status line). Row 0 here = header/help, rows 1..6 = a
 * scrolling window over the 7 fields F_CALL..F_LON -- writing a 7th field row
 * would land on gFrameBuffer[7], off the end of the buffer and off-screen
 * (that was the "Lon invisible" bug on the V1 port). `first` is the top
 * field of the window. */
#define APRS_VIS_ROWS 6

/* Every string reaching UI_PrintStringSmall* must be <= 18 glyphs -- it does
 * not clip and overruns gFrameBuffer[row] (and, on the last row, gEeprom). */
static void draw_config(int sel, int editing, int callcur, int first)
{
    char s[24];
    UI_DisplayClear();

    if (editing && (sel == F_CALL || sel == F_MSGTO))
        sprintf(s, "char %d   A:ok", callcur + 1);
    else if (editing && sel == F_TEXT)
        sprintf(s, "TEXT pos %d UP/DN", callcur + 1);
    else if (editing && (sel == F_LAT || sel == F_LON))
        strcpy(s, "0-9  *:sign  A:ok");
    else if (editing)
        strcpy(s, "UP/DN then A:ok");
    else if (gAprsCfg.opts & APRS_OPT_KISS)
        strcpy(s, "KISS TNC  host USB");
    else
        sprintf(s, "APRS 5:TX *:RX%c%c",
                first > 0 ? '^' : ' ',
                first + APRS_VIS_ROWS < F_N ? 'v' : ' ');
    UI_PrintStringSmallBold(s, 2, 0, 0);

    for (int r = 0; r < APRS_VIS_ROWS; r++) {
        int f = first + r;
        if (f >= F_N)
            break;
        if (editing && f == sel && (f == F_LAT || f == F_LON) && s_klen) {
            char v[16];
            kbuf_render(v, f == F_LAT ? 2 : 3);
            sprintf(s, "%s %s", f == F_LAT ? "Lat " : "Lon ", v);
        } else if (editing && f == sel && (f == F_TEXT || f == F_MSGTO)) {
            const char *b = (f == F_TEXT) ? gAprsCfg.comment : gAprsCfg.msg_to;
            const int   m = (f == F_TEXT) ? 14 : 9;   /* +[ ] brackets <= 18 */
            int w = 0;
            for (int i = 0; i < m; i++) {
                char ch = b[i] ? b[i] : ' ';
                if (i == callcur) { s[w++] = '['; s[w++] = ch; s[w++] = ']'; }
                else              s[w++] = ch;
            }
            s[w] = 0;
        } else {
            field_str(f, s);
        }
        if (f == sel)
            UI_PrintStringSmallBold(s, 2, 0, r + 1);
        else
            UI_PrintStringSmallNormal(s, 2, 0, r + 1);
    }
    ST7565_BlitFullScreen();
}

