f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
/* --- "Send report" wizard: ask Signal (0-9), then Direction (0-359) ------
 * plus s_wiz == 3 : yes/no confirm for the "Send SARSAT" beacon message.     */
static uint8_t s_wiz;       /* 0 none, 1 asking signal, 2 asking dir, 3 confirm bcn */
static uint8_t s_wizsig;    /* signal digit captured in step 1              */

static void draw_wizard(void)
{
    char s[22];
    UI_DisplayClear();
    if (s_wiz == 3) {                          /* confirm SARSAT beacon send */
        UI_PrintStringSmallBold("Send SARSAT ?", 2, 0, 1);
        sprintf(s, "%.15s", s_bcn.hex_id);
        UI_PrintStringSmallNormal(s, 2, 0, 3);
        UI_PrintStringSmallNormal(s_bcn.has_pos ? "with position" : "no position", 2, 0, 4);
        UI_PrintStringSmallNormal("A = send   EXIT", 2, 0, 6);
        ST7565_BlitFullScreen();
        return;
    }
    if (s_wiz == 1) {
        UI_PrintStringSmallBold("Signal 0-9 ?  0=KO", 2, 0, 2);
    } else {
        int w = sprintf(s, "S:%u  Dir? ", s_wizsig);
        for (int i = 0; i < s_klen && w < 16; i++) s[w++] = s_kbuf[i];
        s[w] = 0;
        UI_PrintStringSmallBold(s, 2, 0, 2);
        UI_PrintStringSmallNormal("0-359    A = send", 2, 0, 4);
    }
    ST7565_BlitFullScreen();
}

/* ---- APRS symbol -> 16x16 icon --------------------------------------------
 * Column-major: bytes 0..15 are the top 8-px LCD page (bit0 = top pixel),
 * bytes 16..31 the bottom page. An icon spans two LCD rows. Kept to a small
 * hand-picked set (aprs.fi-style); anything unmapped falls back to a box.
 * Generated by tools/gen_icons.py on the V1 port (edit the pixel grids
 * there, re-run) -- same table reused verbatim here, it's pure pixel data. */
static const uint8_t ICON_BMP[14][32] = {
    { 0x00, 0x80, 0xC0, 0xC0, 0xE0, 0xB0, 0xD0, 0xD0, 0xD0, 0xD0, 0xB0, 0xE0, 0xC0, 0xC0, 0x80, 0x00, 0x00, 0x03, 0x17, 0x3F, 0x3F, 0x17, 0x07, 0x07, 0x07, 0x07, 0x17, 0x3F, 0x3F, 0x17, 0x03, 0x00 },  /*  0 car */
    { 0x00, 0x00, 0x00, 0x80, 0xC0, 0xE0, 0xF0, 0xF8, 0xF8, 0xF0, 0xE0, 0xC0, 0x80, 0x00, 0x00, 0x00, 0x00, 0x7E, 0x7F, 0x7F, 0x43, 0x7F, 0x67, 0x67, 0x67, 0x67, 0x7F, 0x43, 0x7F, 0x7F, 0x7E, 0x00 },  /*  1 house */
    { 0x00, 0x00, 0x80, 0xC0, 0xC0, 0xD8, 0xFC, 0xE4, 0xE4, 0xFC, 0xD8, 0xC0, 0xC0, 0x80, 0x00, 0x00, 0x03, 0x03, 0x21, 0x30, 0x3B, 0x0F, 0x07, 0x07, 0x0F, 0x3B, 0x33, 0x23, 0x00, 0x01, 0x03, 0x03 },  /*  2 person */
    { 0x80, 0x40, 0x40, 0x40, 0x80, 0x00, 0xA0, 0x90, 0x90, 0x20, 0x80, 0x40, 0x40, 0x40, 0x80, 0x00, 0x03, 0x04, 0x04, 0x04, 0x03, 0x01, 0x0E, 0x02, 0x0A, 0x05, 0x03, 0x04, 0x04, 0x04, 0x03, 0x00 },  /*  3 bicycle */
    { 0x00, 0x00, 0x80, 0x80, 0x80, 0x00, 0xC0, 0xE0, 0xE0, 0x20, 0x70, 0xF0, 0xF0, 0x80, 0x80, 0x00, 0x00, 0x07, 0x0F, 0x0D, 0x0F, 0x07, 0x00, 0x0E, 0x0E, 0x0E, 0x0E, 0x00, 0x07, 0x07, 0x01, 0x00 },  /*  4 motorcycle */
    { 0x00, 0x00, 0xF8, 0x88, 0x88, 0x88, 0x88, 0x88, 0x88, 0x88, 0x88, 0xF8, 0xA0, 0xA0, 0xA0, 0x60, 0x00, 0x00, 0x0B, 0x1E, 0x1E, 0x0A, 0x02, 0x02, 0x02, 0x0A, 0x1E, 0x1F, 0x0A, 0x02, 0x03, 0x00 },  /*  5 truck */
    { 0x00, 0x00, 0x80, 0x80, 0x80, 0x80, 0x80, 0xB0, 0x90, 0x90, 0xB0, 0xC0, 0x80, 0x80, 0x80, 0x00, 0x00, 0x03, 0x07, 0x0F, 0x1F, 0x1F, 0x1F, 0x1F, 0x1F, 0x1F, 0x1F, 0x1F, 0x0F, 0x07, 0x03, 0x01 },  /*  6 boat */
    { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xFC, 0xF8, 0xF0, 0xE0, 0xC0, 0x80, 0x00, 0x00, 0x00, 0x00, 0x08, 0x1C, 0x3C, 0x3C, 0x3C, 0x3C, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x1F, 0x0E, 0x08 },  /*  7 sailboat */
    { 0xE0, 0xE0, 0xE0, 0xE0, 0xE0, 0xE0, 0xF8, 0xFC, 0xFC, 0xF8, 0xE0, 0xE0, 0xE0, 0xE0, 0xE0, 0xC0, 0x01, 0x01, 0x01, 0x11, 0x19, 0x1D, 0x0F, 0x07, 0x07, 0x0F, 0x1D, 0x19, 0x11, 0x01, 0x01, 0x00 },  /*  8 aircraft */
    { 0x80, 0x00, 0x40, 0x04, 0xE8, 0xF0, 0xF8, 0xFE, 0xF8, 0xF0, 0xE8, 0x04, 0x40, 0x00, 0x80, 0x00, 0x00, 0x00, 0x01, 0x10, 0x0B, 0x07, 0x0F, 0x3F, 0x0F, 0x07, 0x0B, 0x10, 0x01, 0x00, 0x00, 0x00 },  /*  9 wx */
    { 0x00, 0x00, 0x80, 0x90, 0xA0, 0xC0, 0x80, 0xFC, 0x80, 0xC0, 0xA0, 0x90, 0x80, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x04, 0x02, 0x01, 0x00, 0x1F, 0x00, 0x01, 0x02, 0x04, 0x00, 0x00, 0x00, 0x00 },  /* 10 digipeater */
    { 0x00, 0x00, 0x80, 0xC0, 0xE0, 0xF0, 0x78, 0x3C, 0x78, 0xF0, 0xE0, 0xC0, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x03, 0x07, 0x0F, 0x1E, 0x0F, 0x07, 0x03, 0x01, 0x00, 0x00, 0x00, 0x00 },  /* 11 igate */
    { 0x00, 0x00, 0xFC, 0x04, 0x04, 0x24, 0x34, 0x14, 0x94, 0xF4, 0x64, 0x04, 0x04, 0xFC, 0x00, 0x00, 0x00, 0x00, 0x3F, 0x20, 0x20, 0x20, 0x20, 0x2B, 0x2B, 0x20, 0x20, 0x20, 0x20, 0x3F, 0x00, 0x00 },  /* 12 box (default) */
    { 0x20, 0x30, 0x18, 0x0C, 0x70, 0x80, 0xC0, 0xFE, 0xFE, 0xC0, 0x80, 0x70, 0x0C, 0x18, 0x30, 0x20, 0x80, 0xC0, 0xE0, 0x70, 0x5C, 0x07, 0x00, 0x00, 0x00, 0x00, 0x07, 0x5C, 0x70, 0xE0, 0xC0, 0x80 },  /* 13 repeater tower (/r) */
};

static uint8_t icon_index(char t, char c)
{
    if (t != '/') {                       /* alt table or overlay */
        if (c == '#') return 10;
        if (c == '&') return 11;
    }
    switch (c) {
        case '>':                       return 0;
        case '-':                       return 1;
        case '[':                       return 2;
        case 'b':                       return 3;
        case '<':                       return 4;
        case 'k': case 'u': case 'v':   return 5;
        case 's': case 'C':             return 6;
        case 'Y':                       return 7;
        case '\'': case '^': case 'X': case 'g': return 8;
        case '_':                       return 9;
        case '#':                       return 10;
        case '&':                       return 11;
        case 'r': case 'y':             return 13;   /* repeater tower / yagi */
    }
    return 12;
}

/* blit a 16x16 icon at (col, page rows [row, row+1]) */
static void draw_icon(uint8_t idx, uint8_t col, uint8_t row)
{
    if (idx > 13 || row > 5 || col > 112)
        return;
    memcpy(gFrameBuffer[row]     + col, ICON_BMP[idx],      16);
    memcpy(gFrameBuffer[row + 1] + col, ICON_BMP[idx] + 16, 16);
}

static bool APRS_HasRx(void) { return s_rxi.valid || s_rxn > 0; }

/* int32 1e-5 deg -> "D MM SS.s H" (degrees / minutes / seconds) */
static void adr_dms(char *o, int32_t e5, char pos, char neg)
{
    long v   = e5 < 0 ? -(long)e5 : (long)e5;
    int  d   = (int)(v / 100000);
    long r   = v % 100000;
    long mx  = r * 60;                         /* arcmin * 1e5 */
    int  m   = (int)(mx / 100000);
    long sx  = (mx % 100000) * 60;             /* arcsec * 1e5 */
    int  s10 = (int)(sx / 10000);              /* arcsec * 10  */
    sprintf(o, "%d %02d %02d.%d %c", d, m, s10 / 10, s10 % 10, e5 < 0 ? neg : pos);
}

