f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
static void adr_dec(char *o, int32_t e5)
{
    long v = e5 < 0 ? -(long)e5 : (long)e5;
    sprintf(o, "%s%ld.%05ld", e5 < 0 ? "-" : "", v / 100000, v % 100000);
}

/* sticky coordinate screen for a "REPORT ADRASEC" message from PCT_Report:
 * decimal + degrees/minutes/seconds of the requested point. EXIT to close. */
static void draw_adrasec(void)
{
    char s[24];
    UI_DisplayClear();

    if (s_adr.hasd)                            /* distance/bearing to the point */
        sprintf(s, "ADRASEC %u.%ukm %03u",
                s_adr.dist_hm / 10, s_adr.dist_hm % 10, s_adr.brg);
    else
        sprintf(s, "ADRASEC de %.9s", s_adr.src);
    s[18] = 0;
    UI_PrintStringSmallBold(s, 2, 0, 0);

    /* row 1 blank: a gap under the header. rows 2/3 = lat, row 4 blank,
     * rows 5/6 = lon. (EXIT closes -- the screen is sticky.) */
    adr_dms(s, s_adr.lat, 'N', 'S'); UI_PrintStringSmallNormal(s, 2, 0, 2);
    adr_dec(s, s_adr.lat);           UI_PrintStringSmallNormal(s, 2, 0, 3);
    adr_dms(s, s_adr.lon, 'E', 'W'); UI_PrintStringSmallNormal(s, 2, 0, 5);
    adr_dec(s, s_adr.lon);           UI_PrintStringSmallNormal(s, 2, 0, 6);
    ST7565_BlitFullScreen();
}

/* Received-packet view. The RP2040 C-Board demodulates 144.8 MHz APRS and
 * pushes either a structured decode (0x06D3 -> s_rxi) or, when it cannot parse
 * the info field, raw wrapped text (0x06D2 -> s_rx[]).
 * Layout (header shown only outside the auto-popup): row 0 header; then a
 * 16x16 symbol icon + callsign, Direct/Via path, position / range+bearing /
 * course+speed / wrapped comment. */
static void draw_rx(bool header)
{
    char s[28];
    const uint8_t top = header ? 1 : 0;   /* popup: no "APRS RX" line, shift up */
    UI_DisplayClear();
    if (header) {
        sprintf(s, "APRS RX %u  *:cfg", s_rx_pkts > 999 ? 999 : s_rx_pkts); /* <=18 */
        UI_PrintStringSmallBold(s, 2, 0, 0);
    }

    if (s_rxi.valid) {
        const bool obj = (s_rxi.kind == APRS_RX_KIND_OBJECT);
        const bool msg = (s_rxi.kind == APRS_RX_KIND_MESSAGE);

        draw_icon(icon_index(s_rxi.sym_t, s_rxi.sym_c), 2, top);

        /* right column (col 22): line 1 = name/callsign, line 2 = msg addressee */
        const char *lbl = (obj && s_rxi.name[0]) ? s_rxi.name : s_rxi.src;
        strncpy(s, lbl, 14); s[14] = 0;
        UI_PrintStringSmallNormal(s, 22, 0, top);
        if (msg && s_rxi.name[0]) {
            sprintf(s, ">%.12s", s_rxi.name); s[15] = 0;
            UI_PrintStringSmallNormal(s, 22, 0, top + 1);
        }

        uint8_t row = top + 2;

        /* digi path: "Direct" or "Via A,B" -- wrapped onto up to 2 rows,
         * breaking after a comma so a call is never split. Never overflows. */
        if (row <= 6) {
            char path[36];
            uint8_t n = 0;
            if (s_rxi.via[0]) {
                memcpy(path, "Via ", 4); n = 4;
                for (const char *q = s_rxi.via;
                     *q && n < (uint8_t)(sizeof path - 1); q++)
                    path[n++] = *q;
            } else {
                memcpy(path, "Direct", 6); n = 6;
            }
            path[n] = 0;
            const char *q = path;
            for (int li = 0; li < 2 && *q && row <= 6; li++) {
                char line[APRS_RX_CHARS + 1];
                int  cut = 0, lastc = -1;
                while (q[cut] && cut < APRS_RX_CHARS) {
                    if (q[cut] == ',') lastc = cut;
                    cut++;
                }
                if (q[cut] && lastc >= 0) cut = lastc + 1;   /* break after ',' */
                memcpy(line, q, (size_t)cut);
                line[cut] = 0;
                UI_PrintStringSmallNormal(line, 2, 0, row++);
                q += cut;
            }
        }

        if ((s_rxi.flags & 1) && row <= 6) {         /* position */
            int32_t la = s_rxi.lat, lo = s_rxi.lon;
            char ns = la < 0 ? 'S' : 'N', ew = lo < 0 ? 'W' : 'E';
            if (la < 0) la = -la;
            if (lo < 0) lo = -lo;
            sprintf(s, "%ld.%04ld%c %ld.%04ld%c",
                    (long)(la / 100000), (long)((la % 100000) / 10), ns,
                    (long)(lo / 100000), (long)((lo % 100000) / 10), ew);
            UI_PrintStringSmallNormal(s, 2, 0, row++);
        }
        if ((s_rxi.flags & 8) && row <= 6) {         /* range / bearing to me */
            uint32_t dm = (uint32_t)s_rxi.dist_hm * 100;
            if (dm < 10000)
                sprintf(s, "%lum  %u deg", (unsigned long)dm, s_rxi.bearing);
            else
                sprintf(s, "%lu.%lukm  %u deg", (unsigned long)(dm / 1000),
                        (unsigned long)((dm % 1000) / 100), s_rxi.bearing);
            UI_PrintStringSmallNormal(s, 2, 0, row++);
        }
        if (((s_rxi.flags & 2) || (s_rxi.flags & 4)) && row <= 6) {
            char *w = s;
            if (s_rxi.flags & 2)
                w += sprintf(w, "%ukmh %udeg ", s_rxi.speed, s_rxi.course);
            if (s_rxi.flags & 4)
                sprintf(w, "%dm", s_rxi.alt);
            s[APRS_RX_CHARS] = 0;
            UI_PrintStringSmallNormal(s, 2, 0, row++);
        }
        const char *p = s_rxi.text;                  /* wrapped comment / text */
        while (*p && row <= 6) {
            char line[APRS_RX_CHARS + 1];
            uint8_t k = 0;
            while (*p && k < APRS_RX_CHARS)
                line[k++] = *p++;
            line[k] = 0;
            UI_PrintStringSmallNormal(line, 2, 0, row++);
        }
    } else if (s_rxn == 0) {
        UI_PrintStringSmallNormal("waiting a packet", 2, 0, top + 1);
        UI_PrintStringSmallNormal("radio 144.800 FM", 2, 0, top + 3);
    } else {
        for (uint8_t i = 0; i < s_rxn && i < 4; i++)
            UI_PrintStringSmallNormal(s_rx[i], 2, 0, top + i);
    }
    ST7565_BlitFullScreen();
}

/* Sleep one popup-loop tick. Also flushes any pending backlight PWM fade to
 * completion first -- same rationale as FOXHUNT_TickDelay() in
 * app/foxhunt.c: BACKLIGHT_TurnOn() only *arms* a fade (it sets the target
 * brightness and a step size), the fade itself is only advanced by
 * BACKLIGHT_Update(), which the normal 10 ms tick calls from app.c -- a tick
 * this blocking popup loop does not run, so without pumping it here every
 * BACKLIGHT_TurnOn() in this file (decoded frame, keypress, entry) would
 * never reach the hardware PWM until the loop exits ("backlight only lights
 * up as the popup closes, even on a keypress", reported on air).
 * BACKLIGHT_Update() is pumped 16 times back-to-back rather than once per
 * 10 ms slice: the fade always completes in <= 16 steps regardless of the
 * jump size (fadeStep is diff/16, see BACKLIGHT_SetBrightness()), so 16
 * calls always finish it -- spreading it across the ~160 ms of a slower loop
 * made the ramp plainly visible on screen ("effet de fondu" reported once
 * the backlight fix landed); flushing it up front makes each brightness
 * change look as instant here as it does on the normal (non-blocking) UI,
 * where the same ~160 ms ramp is masked by the screen changing under it. */
static void APRS_TickDelay(uint32_t ms)
{
    for (int i = 0; i < 16; i++)
        BACKLIGHT_Update();
    SYSTEM_DelayMs(ms);
}

void APP_RunAprs(void)
{
    APRS_Ensure();
    AFGAIN_ResyncKnob();
    AFGAIN_Apply();                        /* level right regardless of prior menu use */

    const bool popup = gAprsShowRequest;   /* opened by the tick, not by a key */
    gAprsShowRequest = false;

    /* This blocking screen can be opened from the 10 ms tick (auto-popup on an
     * RX packet), not only from a key -- only take the radio over when it is
     * idle on the main screen, else re-arm and bail (same rule as SARSAT). */
    if (gScreenToDisplay != DISPLAY_MAIN || gCurrentFunction == FUNCTION_TRANSMIT ||
        gScanStateDir != SCAN_OFF) {
        if (popup && APRS_HasRx()) gAprsShowRequest = true;
        return;
    }

    /* F+5 lands the RX VFO on the dedicated APRS channel (MR 170) for the whole
     * time the menu is open, so APRS RX is live immediately whatever frequency
     * the radio was on (406 MHz SARSAT, a random channel...). Borrow the TX_VFO
     * slot exactly like APRS_TxFrame(); the exit cleanup below restores it.
     * Not done for an auto-popup: the radio is already on 144.8 (that is how a
     * packet decoded to open the popup in the first place). */
    const uint8_t borrow_vfo = gEeprom.TX_VFO;
    const bool    borrowed   = !popup;
    VFO_Info_t saved_vfo = gEeprom.VfoInfo[borrow_vfo];
    uint8_t    saved_sc  = gEeprom.ScreenChannel[borrow_vfo];
    uint8_t    saved_mrc = gEeprom.MrChannel[borrow_vfo];
    uint8_t    saved_rxv = gEeprom.RX_VFO;
    if (borrowed) {
        aprs_refresh_ch_freq();                           /* channel may have been edited */
        gEeprom.ScreenChannel[borrow_vfo] = APRS_TX_CHANNEL;
        gEeprom.RX_VFO                    = borrow_vfo;   /* single-VFO for APRS */
        RADIO_ConfigureChannel(borrow_vfo, VFO_CONFIGURE_RELOAD);
        RADIO_SelectVfos();
    }

    /* Manual open -> re-tune the BK4829 for FM RX on channel 170. The screen
     * otherwise inherits whatever RX state it opened on -- AF muted after a TX,
     * not demodulating. RADIO_SetupRegisters() sets the FM demod (un-mutes the
     * AF) + the squelch and leaves the SPEAKER muted; the mini-squelch loop
     * below opens it only on a real carrier (no persistent idle hiss). The
     * operator's own AF-gain setting is kept so the level matches the C-Board. */
    const bool monitor = borrowed;

