f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
    if (monitor) {
        RADIO_SelectVfos();
        RADIO_SetupRegisters(true);
        RADIO_SetModulation(gRxVfo->Modulation);   /* un-mute the BK4819 AF to
                                                    * the VFO's demod (this
                                                    * firmware's RADIO_Setup-
                                                    * Registers() already does
                                                    * it, harmless to repeat) */
        /* ⚠️ NEW (2026-09-16, operator-reported sync lag on manual APRS
         * open): same AGC settle guard as SONDE_TickDelay(300) in
         * patch/sonde.c, same rationale. RADIO_SetModulation() above goes
         * through RADIO_SetupAGC()'s lastSettings cache (App/radio.c) --
         * this screen usually retunes from a completely different
         * frequency/modulation (SARSAT 406 MHz, a random channel...), and
         * that cache can now skip BK4819_InitAGC() if the new/old settings
         * happen to match, leaving the AGC gain table still assuming the
         * PREVIOUS frequency for a moment. Untested whether this is really
         * the cause of the reported lag -- try 300 ms first (Sonde's
         * already-validated value), revert outright if it makes no
         * difference on air rather than guessing a different duration. */
        APRS_TickDelay(300);
        gEnableSpeaker = true;
        APRS_ApplySquelch();
        APRS_ApplyRxAudio();
        APRS_ApplyAfc();
        AFGAIN_Apply();
        g_SquelchLost = false;
        BK4819_ToggleGpioOut(BK4819_GPIO6_PIN2_GREEN, false);
    } else if (!g_SquelchLost) {          /* channel already idle -> silence it now */
        AUDIO_AudioPathOff();
        BK4819_ToggleGpioOut(BK4819_GPIO6_PIN2_GREEN, false);
    }

    /* auto-popup (from the tick, on a decoded packet) opens on the RX view;
     * a manual key always opens on the config menu (press * for the last RX). */
    int sel = 0, editing = 0, callcur = 0, first = 0,
        view = s_adrasec ? 2 : (popup ? 1 : 0);
    bool armed = false, run = true, closed_by_key = false;
    KEY_Code_t prev = KEY_INVALID;
    bool dirty = true;
    uint16_t last_pkts = s_rx_pkts;
    uint8_t  last_msg   = s_msg.state;
    uint8_t  last_tries = s_msg.tries;   /* redraw the "Send report" row on each (re)send */
    s_wiz = 0;

    /* auto-popups close themselves after gAprsCfg.popup_s (unless a key is hit);
     * the ADRASEC screen never auto-closes -- EXIT only */
    const bool timed = (popup && gAprsCfg.popup_s && !s_adrasec);
    uint32_t close_at = timed ? millis10() + gAprsCfg.popup_s * 100u : 0;
    uint32_t msq_mute_at = 0;    /* deferred speaker mute (see mini squelch) */

    BACKLIGHT_TurnOn();

    while (run) {
#ifdef ENABLE_UART
        while (UART_IsCommandAvailable(UART_PORT_UART))
            UART_HandleCommand(UART_PORT_UART);
#endif
        APRS_ApplySquelch();     /* the tick can't -- keep the APRS-band fast
                                  * squelch on so packets that arrive while this
                                  * screen is open are not chopped (1 reg read) */
        APRS_ApplyRxAudio();     /* keep the RX audio profile FLAT for the C-Board */
        APRS_ApplyAfc();         /* keep the AFC excursion range restricted          */
        /* mini squelch: the main loop (which normally does this) is blocked.
         * carrier present -> speaker path + RX LED on (the C-Board hears it).
         * carrier gone    -> mute the speaker, but only a bit LATER: APRS
         * packets come in bursts a fraction of a second apart, and cutting the
         * audio feed to the C-Board between them breaks its bit-PLL / HDLC
         * framing -> "la LED s'allume, du souffle, mais la trame ne passe pas".
         * The deferred mute keeps the feed continuous across those short gaps
         * and only silences the channel after a real lull.
         * ⚠️ SHORTENED (2026-09-14, on explicit user request -- audio staying
         * audible for a couple of seconds after the squelch closed was too
         * noticeable on the operator's ear): 2 s -> 300 ms. Still bridges a
         * same-burst gap between two packets a fraction of a second apart,
         * just far less audible than before; if this ever reintroduces the
         * "la LED s'allume, du souffle, mais la trame ne passe pas" symptom,
         * lengthen this back up rather than dropping the deferred mute
         * entirely (see the note above for why an instant cut is unsafe). */
        while (BK4819_ReadRegister(BK4819_REG_0C) & 1u) {
            BK4819_WriteRegister(BK4819_REG_02, 0);
            uint16_t ib = BK4819_ReadRegister(BK4819_REG_02);
            if (ib & BK4819_REG_02_SQUELCH_LOST) {
                g_SquelchLost = true;
                msq_mute_at = 0;
                AUDIO_AudioPathOn();
                BK4819_ToggleGpioOut(BK4819_GPIO6_PIN2_GREEN, true);
            }
            if (ib & BK4819_REG_02_SQUELCH_FOUND) {
                g_SquelchLost = false;
                if (!msq_mute_at) msq_mute_at = millis10() + 30;   /* +300 ms */
                BK4819_ToggleGpioOut(BK4819_GPIO6_PIN2_GREEN, false);
            }
        }
        if (msq_mute_at && (int32_t)(millis10() - msq_mute_at) >= 0) {
            msq_mute_at = 0;
            AUDIO_AudioPathOff();
        }

        /* This loop is what receives 0x06D6 (UART_HandleCommand() above, when
         * the RX popup is what's open) and queues it via APRS_Digipeat() --
         * but the retry that actually sends it, APRS_DigipeatTimeSlice(), is
         * normally pumped from APRS_TimeSlice(), which this same blocking
         * loop prevents from running at all. Without this, a digipeat
         * opportunity arriving while the popup is up (the common case: the
         * popup auto-opens on the very packet being repeated) would sit
         * queued until popup_s expires or the 3 s staleness timeout kills
         * it, whichever comes first -- effectively never sent. */
        APRS_DigipeatTimeSlice();
        APRS_MsgTimeSlice();             /* keep the "121 MHz report" retrying */

        /* "Light on frame": reported on air as "the backlight stays dark
         * through the whole popup, then flashes on right as it closes" --
         * i.e. only the unconditional BACKLIGHT_TurnOn() in this function's
         * own exit path (below) was ever visible; the one-shot call from
         * aprs_rx_arrived() (fired once, the instant the frame decodes)
         * wasn't sticking, for a reason not pinned down from the source
         * alone. Reasserting it every loop iteration (~20 ms) for as long as
         * the popup/screen stays open is a stronger guarantee regardless of
         * cause -- same fix shape as AFGAIN_TimeSlice() earlier in this
         * project (a one-shot apply that silently got overridden). */
        if (gAprsCfg.opts & APRS_OPT_BL_DECODE)
            BACKLIGHT_TurnOn();

        /* a new decoded packet: only an AUTO-popup reacts to it -- keep it on
         * the RX view and re-arm its close timer while traffic flows. A
         * MANUAL open (F+5) stays put on whatever the user is looking at:
         * decoding (and the report-ack match) runs in the background either
         * way; press * for the last RX frame. */
        if (s_rx_pkts != last_pkts) {
            last_pkts = s_rx_pkts;
            if (close_at) {
                close_at = millis10() + gAprsCfg.popup_s * 100u;
                if (!editing && !s_wiz) view = 1;
            }
        }
        if (close_at && (int32_t)(millis10() - close_at) >= 0)
            break;

        /* the message state advances from the tick / this loop's own
         * APRS_MsgTimeSlice(); redraw the F_SEND row when it changes */
        if (s_msg.state != last_msg || s_msg.tries != last_tries) {
            last_msg = s_msg.state; last_tries = s_msg.tries; dirty = true;
        }

        /* an ADRASEC request that arrived while this screen was already open */
        if (s_adrasec && view != 2) { view = 2; close_at = 0; dirty = true; }

