f4dvk/Sarsat_UV-K1-5_RP2040/firmware/uv-k1-k5v3/patch/aprs.c
        if (sel < first)                    first = sel;
        if (sel > first + APRS_VIS_ROWS - 1) first = sel - (APRS_VIS_ROWS - 1);
        if ((view == 1 || view == 2) && s_rx_dirty) { s_rx_dirty = false; dirty = true; }
        if (dirty) {
            dirty = false;
            if      (s_wiz)     draw_wizard();
            else if (view == 2) draw_adrasec();
            else if (view == 1) draw_rx(!popup);   /* popup: hide the "APRS RX" line */
            else               draw_config(sel, editing, callcur, first);
        }

        KEY_Code_t k = KEYBOARD_Poll();
        if (k == KEY_INVALID) { armed = true; prev = k; APRS_TickDelay(20); continue; }
        if (!armed || k == prev) { APRS_TickDelay(20); continue; }
        prev = k;
        dirty = true;
        close_at = 0;                         /* a key cancels the auto-close */
        k = nav_key(k);                       /* UV-K1 SetNav (see nav_key()) */

        /* This loop blocks the main task, whose backlight and auto-keypad-lock
         * countdowns then never tick -- so nothing turns them back on. Refresh
         * both on every key so the screen stays lit and the pad stays live. */
        BACKLIGHT_TurnOn();
        gKeyLockCountdown = 30;

        if (s_wiz) {                          /* "Send report" wizard */
            if (s_wiz == 3) {                 /* confirm the SARSAT beacon send */
                if      (k == KEY_MENU) { APRS_MsgStartBeacon(); s_wiz = 0; }
                else if (k == KEY_EXIT) { s_wiz = 0; }
            } else if (s_wiz == 1) {          /* step 1: signal digit 0-9 */
                if (k <= KEY_9) {
                    s_wizsig = (uint8_t)k;
                    if (s_wizsig == 0) { APRS_MsgStart(0, 0); s_wiz = 0; }
                    else               { s_wiz = 2; s_klen = 0; }
                } else if (k == KEY_EXIT) {
                    s_wiz = 0;
                }
            } else {                          /* step 2: direction 0-359 */
                if (k <= KEY_9 && s_klen < 3) {
                    int v = 0;
                    for (int i = 0; i < s_klen; i++) v = v * 10 + (s_kbuf[i] - '0');
                    v = v * 10 + (int)k;
                    if (v <= 359) s_kbuf[s_klen++] = (char)('0' + (int)k);
                } else if (k == KEY_MENU && s_klen) {   /* A: send (need a value) */
                    int v = 0;
                    for (int i = 0; i < s_klen; i++) v = v * 10 + (s_kbuf[i] - '0');
                    APRS_MsgStart(s_wizsig, (uint16_t)v);
                    s_wiz = 0;
                } else if (k == KEY_EXIT) {
                    s_wiz = 0;
                }
            }
            APRS_TickDelay(20);
            continue;
        }

        if (view == 2) {                      /* ADRASEC: sticky, EXIT only */
            if (k == KEY_EXIT) { run = false; closed_by_key = true; }
            continue;
        }

        if (view == 1) {                      /* RX view */
            if      (k == KEY_STAR) view = 0;         /* -> config */
            else if (k == KEY_EXIT) { run = false; closed_by_key = true; }  /* -> close */
            continue;
        }

        if (!editing) {
            switch (k) {
            case KEY_UP:   sel = (sel + F_N - 1) % F_N; break;
            case KEY_DOWN: sel = (sel + 1) % F_N;       break;
            case KEY_MENU:
                if (sel == F_SEND) {          /* launch the report wizard */
                    if (APRS_MsgCanSend()) { s_wiz = 1; s_wizsig = 0; s_klen = 0; }
                    break;
                }
                if (sel == F_SENDB) {         /* confirm + send the SARSAT beacon */
                    if (s_bcn.valid && APRS_MsgCanSend()) s_wiz = 3;
                    break;
                }
                editing = 1; callcur = 0; s_klen = 0;
                s_kneg = (sel == F_LAT) ? (gAprsCfg.lat_e5 < 0) :
                         (sel == F_LON) ? (gAprsCfg.lon_e5 < 0) : 0;
                break;
            case KEY_STAR: view = 1;                    break;   /* -> RX view */
            case KEY_5:    APRS_Beacon();               break;
            case KEY_EXIT: run = false; closed_by_key = true; break;
            default: break;
            }
        } else if (sel == F_CALL || sel == F_TEXT || sel == F_MSGTO) {
            const bool txt  = (sel == F_TEXT);
            const bool addr = (sel == F_MSGTO);
            char       *buf = addr ? gAprsCfg.msg_to
                                   : txt ? gAprsCfg.comment : gAprsCfg.call;
            const int   fw  = addr ? 9 : txt ? 14 : 6;
            const char *set = addr ? ADDRSET : txt ? TEXTSET : CALLSET;
            switch (k) {
            case KEY_UP:   buf[callcur] = cyc_char(buf[callcur], +1, set); break;
            case KEY_DOWN: buf[callcur] = cyc_char(buf[callcur], -1, set); break;
            case KEY_STAR: callcur = (callcur + 1) % fw; break;
            case KEY_MENU: editing = 0; APRS_Save(); APRS_PushConfig(); break;
            case KEY_EXIT: editing = 0; APRS_Init();    break;   /* reload */
            default: break;
            }
        } else if (sel == F_LAT || sel == F_LON) {
            if (k <= KEY_9) {                       /* a digit */
                int cap = (sel == F_LAT ? 2 : 3) + 5;
                if (s_klen < cap) s_kbuf[s_klen++] = (char)('0' + (int)k);
            } else switch (k) {
            case KEY_STAR: s_kneg ^= 1;                          break;
            case KEY_UP:   if (!s_klen) field_step(sel, +1);     break;
            case KEY_DOWN: if (!s_klen) field_step(sel, -1);     break;
            case KEY_MENU: kbuf_commit(sel); editing = 0;
                           APRS_Save(); APRS_PushConfig();       break;
            case KEY_EXIT: editing = 0; APRS_Init();             break;
            default: break;
            }
        } else {
            switch (k) {
            case KEY_UP:   field_step(sel, +1); break;
            case KEY_DOWN: field_step(sel, -1); break;
            case KEY_MENU: editing = 0; APRS_Save(); APRS_PushConfig(); break;
            case KEY_EXIT: editing = 0; APRS_Init(); break;
            default: break;
            }
        }
        APRS_TickDelay(20);
    }

    /* restore normal operation. This screen can be auto-opened from the 10 ms
     * tick, so finish the cleanup synchronously (same as APP_RunSarsat): leave
     * any monitor function, re-read + validate both VFOs from EEPROM, re-tune,
     * refresh the frozen backlight / key-lock timers, and switch back to MAIN
     * now rather than "on request". */
    gAprsShowRequest      = false;
    s_adrasec             = false;   /* consumed; a fresh request re-opens it */
    /* cooldown before the next auto-popup: 5 s if the user pressed EXIT (they
     * dismissed it), ~0.3 s on a plain timed close so a busy channel's next
     * frame still pops. */
    s_autopop_block_10ms  = millis10() + (closed_by_key ? 500u : 30u);
    gMonitor = false;

    if (borrowed) {                    /* give channel 170's slot back to the VFO */
        gEeprom.VfoInfo[borrow_vfo]       = saved_vfo;
        gEeprom.ScreenChannel[borrow_vfo] = saved_sc;
        gEeprom.MrChannel[borrow_vfo]     = saved_mrc;
        gEeprom.RX_VFO                    = saved_rxv;
    }

    FUNCTION_Select(FUNCTION_FOREGROUND);
    RADIO_ConfigureChannel(0, VFO_CONFIGURE);
    RADIO_ConfigureChannel(1, VFO_CONFIGURE);
    RADIO_SelectVfos();
    RADIO_SetupRegisters(true);        /* AUDIO_AudioPathOff + retune: squelch
                                        * back to normal after the popup */
    BACKLIGHT_TurnOn();
    gKeyLockCountdown = 30;
    /* "light on frame" + this was an auto-popup: dim ~1 s after it closed */
    s_bl_off_10ms = (popup && (gAprsCfg.opts & APRS_OPT_BL_DECODE))
                        ? millis10() + 100 : 0;

    GUI_SelectNextDisplay(DISPLAY_MAIN);
    gUpdateDisplay = true;
    gUpdateStatus  = true;
}

#endif /* ENABLE_APRS */
